[{"Unnamed: 0":2,"brand":"Lancôme","category":"Mascara","name":"Monsieur Big Mascara","ingredients":"Water- Paraffin- Potassium Cetyl Phosphate- Copernicia Cerifera Cera \/ Carnauba Wax- Ethylene\/Acrylic Acid Copolymer- Styrene\/Acrylates\/Ammonium Methacrylate Copolymer- Cera Alba \/ Beeswax- Synthetic Beeswax- Bis-Diglyceryl Polyacyladipate-2- Polybutene- Cetyl Alcohol- Steareth-20- Glyceryl Dibehenate- Steareth-2-C12-13 Pareth-23- C12-13 Pareth-3- Tribehenin- Acacia Senegal Gum- Glyceryl Behenate- Sodium Laureth Sulfate- Silica- Divinyldimethicone\/Dimethicone Copolymer- Disodium Edta- Hydrogenated Jojoba Oil- Hydrogenated Palm Oil- Hydroxyethylcellulose- Caprylyl Glycol- Tetrasodium Edta- Ethylenediamine\/Stearyl Dimer Dilinoleate Copolymer- Butylene Glycol- Bht- Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate- Potassium Sorbate- Sodium Dehydroacetate- Phenoxyethanol- [+\/- May Contain- Ci 75470 \/ Carmine- Ci 77007 \/ Ultramarines-Ci 77491- Ci 77492- Ci 77499 \/ Iron Oxides]. \n","details":"What it is: A long-lasting- voluminous mascara with a black-boosting polymer in its pigment for 12 times more volume and up to 24 hours of wear.What Else You Need to Know: This creamy- lengthening mascara with a gel-like texture does not require touch-ups. This voluminous mascara glides smoothly onto lashes for an even- buildable- and clump-free application.  Eyelashes appear extra intense due to black-boosting polymers and an intense grade of rich black pigments. Clinical Results: - 95% felt that it glides easily onto lashes- 95% found that it’s comfortable to wear all day long- 92% found the color of the mascara very dark\/intense","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1956176-main-zoom.jpg?imwidth=930","id":"0385504209"},{"Unnamed: 0":3,"brand":"Lancôme","category":"Mascara","name":"DÉFINICILS - High Definition Mascara","ingredients":"Water- Paraffin- Stearic Acid- Triethanolamine- Cera Alba\/Beeswax\/Cire Dabeille- Acacia Senegal\/Acacia Senegal Gum- Palmitic Acid- Cera- Carnauba\/Carnauba Wax\/Cire De Carnauba- Hydroxyethylcellulose- Panthenol- Imidazolidinyl Urea- Sodium Polymethacrylate- Methylparaben- Propylparaben- Simethicone- Bht- Silica- Polyquaternium-10- [+\/- May Contain: Ci 77499- Ci 77492- Ci 77491 \/ Iron Oxides- Ci 77007 \/Ultramarines- Mica- Ci 77891\/Titanium Dioxide- Ci 75470\/Carmine- Ci 77510\/Ferric Ferrocyanide].","details":"What it is: An iconic mascara that creates clean and defined- natural-looking lashes.What Else You Need to Know: This mascara helps define eyelashes using polymers formulated to lengthen. The fine comb-like brush has a \"hedgehog\" bristles pattern that enables it to dispense the perfect amount of product lash by lash for gradual and even application. ","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s137471-main-zoom.jpg?imwidth=930","id":"0060928336"},{"Unnamed: 0":19,"brand":"Lancôme","category":"Eyeliner","name":"DRAMA LIQUI-PENCIL™ Longwear Eyeliner","ingredients":"-Double Polymer Complex: Allows the formula to attach to the skin- so it never breaks.\n-Volatile Gliding Oil: Provides nourishing color richness and pigment load that settles onto the lid.\n-Soft Waxes: Adhere to the skin- leaving a creamy- easy glide- and blendable texture.\n-Volatile Gliding Oils and Vitamin E: Nourish the skin for comfortable- all-day wear.\n\nRimethylsiloxysilicate- Isododecane- Hydrogenated Polyisobutene- Synthetic Wax- Hydrogenated Polydicyclopentadiene- C20-40 Alcohols- Nylon-611\/Dimethicone Copolymer- Calcium Sodium Borosilicate- Disteardimonium Hectorite- Polyethylene- Tin Oxide- Calcium Aluminum Borosilicate- Silica- Alumina- Propyl Carbonate- Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate.\n","details":"What it is: An eyeliner pencil that is smudgeable- with long-lasting color payoff in matte and metallic finishes.What Else You Need to Know: With its unique hybrid formula- this eyeliner has the high-intensity color payoff of a liquid liner with the ease of application of a pencil.  While creamy and smudgegable when first applied- Drama Liqui-Pencil sets quickly and will not fade or move.  ","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2480051-main-zoom.jpg?imwidth=930","id":"0345337662"},{"Unnamed: 0":27,"brand":"Urban Decay","category":"Mascara","name":"Perversion Mascara","ingredients":"-Hairdensyl: Helps support lash growth.-Honey Extract: Nurtures lashes-Marine Collagen: Protects lashes. Water- Synthetic Beeswax- Acacia Senegal Gum- Stearic Acid- Palmitic Acid- Copernicia Cerifera (Carnauba) Wax (Cera Carnauba\/Cire de Carnuba)- Butylene Glycol- Glyceryl Stearate- Polybutene- VP\/Eicosene Copolymer- Aminomethyl Propanol- Pentylene Glycol- Phenoxyethanol- Caprylyl Glycol- Sodium Dehydroacetate- Potassium Sorbate- Hydroxyethylcellulose- Soluble Collagen- Myristic Acid- Arachidic Acid- Behenic Acid- Glycerin- Propylene Glycol- Oleic Acid- Mel (Honey\/Miel) Extract- Sodium PCA- Hydrolyzed Elastin- Glycogen- Serine. [+\/- (May Contain): CI 77499 (Iron Oxides)].","details":"What it is: An ultra-creamy- lengthening- and volumizing mascara that delivers the dramatic look of false eyelashes.Highlighted Ingredients: - Hairdensyl: Helps support lash growth.- Honey Extract: Nurtures lashes.- Marine Collagen: Protects lashes.Ingredient Callouts: Free of parabens. This product is also cruelty-free.What Else You Need to Know: Perversion’s creamy texture delivers the deepest- most intense black color- while the volumizing brush separates and defines for a clean- clump-free finish. Formulated with marine collagen and honey extract- this mascara nurtures and protects.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1635770-main-zoom.jpg?imwidth=930","id":"0156027321"},{"Unnamed: 0":32,"brand":"Urban Decay","category":"Concealer","name":"Stay Naked Correcting Concealer","ingredients":"Water- Cyclopentasiloxane- Butylene Glycol- Silica- Cyclohexasiloxane- Glycerin- Isononyl Isononanoate- Peg\/Ppg-18\/18 Dimethicone- Dimethicone- Camellia Sinensis Leaf Extract- Sodium Chloride- Cetyl Peg\/Ppg-10\/1 Dimethicone- Disteardimonium Hectorite- Isopropyl Titanium Triisostearate- Phenoxyethanol- Trimethylsiloxysilicate- Caprylyl Glycol- Propylene Carbonate- Tocopheryl Acetate- Triethoxycaprylylsilane- Tetrahexyldecyl Ascorbate- Alumina- Carbomer- Sodium Lactate- Litchi Chinensis Pericarp Extract- Polysorbate 20- Biosaccharide Gum-1- Sodium Hyaluronate- Disodium Edta- Sodium Benzoate- Tocopherol- Palmitoyl Tripeptide-1- Palmitoyl Tetrapeptide-7- Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate. May Contain (+\/-):Titanium Dioxide (Ci 77891)- Iron Oxides (Ci 77491- Ci 77492- Ci 77499)- Bismuth Oxychloride (Ci 77163). ","details":"What it is:  An ultra-pigmented- lightweight concealer that covers hyperpigmentation and imperfections with a real-skin- matte finish- and lasts up to 24 hours.Coverage: FullFinish: MatteFormulation: Liquid Skin Type: Normal- Dry- Combination- and Oily Ingredient Callouts: This product is vegan and cruelty-free.What Else You Need to Know: With 25 vegan shades- this concealer features nine shade intensities- three master-tones- five undertones- and enough coverage to last all day. Use this flexible- second-skin concealer for just about anything- from covering an imperfection to highlighting a cheekbone. The patented- wave-tip applicator makes it easy to get the right level of coverage. Use the flat side for precise- light application or lean into the curve for a heavier dose of product.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2247476-main-zoom.jpg?imwidth=930","id":"0786868716"},{"Unnamed: 0":45,"brand":"Urban Decay","category":"Makeup","name":"Perversion Mascara Mini","ingredients":"Aqua \/ Water- Synthetic Beeswax- Cera Alba \/ Beeswax- Acacia Senegal Gum- Stearic Acid- Palmitic Acid- Glyceryl Stearate- VP\/Eicosene Copolymer- Copernicia Cerifera Cera \/ Carnauba Wax- Polybutene- Butylene Glycol- Stearyl Stearate- Aminomethyl Propanol- Pentylene Glycol- Phenoxyethanol- Caprylyl Glycol- Sodium Dehydroacetate- Paraffin- Potassium Sorbate- Hydroxyethylcellulose- Soluble Collagen- Behenic Acid- Glycerin- Propylene Glycol- Mel Extract \/ Honey Extract- Sodium PCA- Hydrolyzed Elastin- Sorbic Acid- Glycogen- Serine. [+\/- (May contain\/Peut contenir): CI 77499 \/ Iron Oxides]. ","details":"What it is:\nAn ultracreamy- lengthening- and volumizing mascara for stand-out lashes.\nWhat it does:\nPerversion glides on easily to instantly create sexy lashes. It has a creamy- full-bodied texture that is not too dry and not too wet to allow just the right amount of pull as it glides through lashes. This formula is not sticky or clumpy- and it contains Hairdensyl- a complex blend of proteins and amino acids that are known to stimulate lash growth. The honey extract provides deep nourishment- sea idrolized elastine stimulates the hair follicle- and marine collagen protects. The high-tech- volumizing brush separates and defines each lash for a clean- clump-free finish- and the triple-black pigments leave them looking intensely black.\nWhat it is formulated WITHOUT:- Parabens","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1668870-main-zoom.jpg?imwidth=930","id":"0440220602"}]