[{"Unnamed: 0":0,"brand":"Lancôme","category":"Foundation","name":"Teint Idole Ultra Long Wear Foundation","ingredients":" -Eternalsoft Polymer: Increases comfort level with long-lasting wear.\n-NAI Pigments: Specially-coated pigments maintain consistent pH level with skin- so color stays true all day.\n-Perlite and Silica: Absorb oil effectively.\n\nWater- Cyclopentasiloxane- Polypropysilsequioxane- Isododecane- Dimethicone- C30-45 Alkyldimethylsilyl- Polypropylsilsequioxane Silica- Glycerin- Peg-10 Dimethicone- Dimethicone\/Polyglycerinej-3 Crosspolymer- Sodium Chloride- Nylon-12- Paraffin- Cyclomethione- Aluminum Hydroxide- Disodium Edta- Disodium Stearoyl Glutamate- Dipropylene Glycol- Disteardimonium Hectorite- Acrylates Copolymer- Phenoxyethanol Chlorphenesin- Ethylparaben- [+\/- May Contain CI 77007 \/ Ultramarines- CI 77491- CI 77492- CI 77499 \/ Iron Oxides- CI 77891 \/ Titanium Dioxide].","details":"What it is: An oil-free- long-wearing- liquid foundation that delivers buildable coverage and leaves a natural-looking- velvety-matte finish for up to 24 hours.Skin Type: Normal- Dry- Combination- and OilyCoverage: Full   Finish: Matte    Formulation: Liquid  Ingredient Callouts: Free of fragrance.  What Else You Need to Know: Teint Idole Ultra Long Wear—now available in 50 shades—is guaranteed to have your shade. In a study with 400 women- 98 percent of participants were able to find their perfect shade match.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2667970-main-zoom.jpg?imwidth=930","id":"0971880107"},{"Unnamed: 0":1,"brand":"Lancôme","category":"Mascara","name":"CILS BOOSTER XL Super-Enhancing Mascara Base","ingredients":"Water- Oryza Sativa Cera\/Rice Bran Wax- Cera Carnauba\/Carnauba Wax\/Cire De Carnauba- Cera Alba\/Beeswax\/Cire D'abeille- Stearic Acid- Candelilla Cera\/Candelilla Wax\/Cire De Candelilla- Triethanolamine- Palmitic Acid- Acacia Senegal\/Acacia Senegal Gum- Panthenol- Sodium- Polymethacrylate- Hydroxyethylcellulose- Propylparaben- Peg\/Ppg-17\/18 Dimethicone- Methylparaben- Simethicone- Rayon- Polyquaternium-10- Tocopheryl Acetate- Polycaprolactone.","details":"What it is: \nA lash-conditioning mascara primer to maximize mascara results—creating even longer-looking and more volumized lashes.\nHighlighted Ingredients: - Vitamin E and Micro-Fibers: Condition lashes.What Else You Need to Know: With just one sweep- this iconic mascara primer evenly coats lashes to maximize the results of your favorite mascara. The conditioning formula- infused with micro-fibers and vitamin E- adds a look of extra length and thickness to lashes. At night- this can also be used as a lash mask to nurture lashes.Clinical Results: In a consumer test with a panel of 103 women using CILS BOOSTER and their regular mascara:- 93% saw more length- 92% saw more volume- 85% saw more curl\n","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2109965-main-zoom.jpg?imwidth=930","id":"0316666343"},{"Unnamed: 0":2,"brand":"Lancôme","category":"Mascara","name":"Monsieur Big Mascara","ingredients":"Water- Paraffin- Potassium Cetyl Phosphate- Copernicia Cerifera Cera \/ Carnauba Wax- Ethylene\/Acrylic Acid Copolymer- Styrene\/Acrylates\/Ammonium Methacrylate Copolymer- Cera Alba \/ Beeswax- Synthetic Beeswax- Bis-Diglyceryl Polyacyladipate-2- Polybutene- Cetyl Alcohol- Steareth-20- Glyceryl Dibehenate- Steareth-2-C12-13 Pareth-23- C12-13 Pareth-3- Tribehenin- Acacia Senegal Gum- Glyceryl Behenate- Sodium Laureth Sulfate- Silica- Divinyldimethicone\/Dimethicone Copolymer- Disodium Edta- Hydrogenated Jojoba Oil- Hydrogenated Palm Oil- Hydroxyethylcellulose- Caprylyl Glycol- Tetrasodium Edta- Ethylenediamine\/Stearyl Dimer Dilinoleate Copolymer- Butylene Glycol- Bht- Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate- Potassium Sorbate- Sodium Dehydroacetate- Phenoxyethanol- [+\/- May Contain- Ci 75470 \/ Carmine- Ci 77007 \/ Ultramarines-Ci 77491- Ci 77492- Ci 77499 \/ Iron Oxides]. \n","details":"What it is: A long-lasting- voluminous mascara with a black-boosting polymer in its pigment for 12 times more volume and up to 24 hours of wear.What Else You Need to Know: This creamy- lengthening mascara with a gel-like texture does not require touch-ups. This voluminous mascara glides smoothly onto lashes for an even- buildable- and clump-free application.  Eyelashes appear extra intense due to black-boosting polymers and an intense grade of rich black pigments. Clinical Results: - 95% felt that it glides easily onto lashes- 95% found that it’s comfortable to wear all day long- 92% found the color of the mascara very dark\/intense","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1956176-main-zoom.jpg?imwidth=930","id":"0385504209"},{"Unnamed: 0":7,"brand":"Lancôme","category":"Mascara","name":"HYPNÔSE DRAMA Instant Full Body Volume Mascara","ingredients":"Isododecane- Cera Alba\/Beeswax- Copernicia Cerifera Cera\/Carnauba Wax- Disteardimonium Hectorite- Water- Allyl Stearate\/Va Copolymer- Oryza Sativa Cera\/Rice Bran Wax- Paraffin- Alcohol Denat.- Polyvinyl Laurate Vp\/Eicosene Copolymer- Propylene Carbonate- Talc- Synthetic Beeswax- PEG-30 Glyceryl Stearate- Candelilla Cera\/Candelilla Wax- Panthenol- Ethylenediamine\/Stearyl Dimer Dilinoleate Copolymer- Methylparaben- Propylparaben- [+\/- (May Contain): CI 77499 (Iron Oxides)].","details":"What it is: An intense black mascara with a unique S-shaped brush for instant volume in a single stroke.What Else You Need to Know: This volumizing mascara creates lash drama in a single coat—without clumping or flaking.  The full-contact brush has an S-shaped curve to grasp and evenly coat lashes from root to tip for bold- buildable volume.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1197458-main-zoom.jpg?imwidth=930","id":"0142001740"},{"Unnamed: 0":51,"brand":"Urban Decay","category":"Eyeliner","name":"24\/7 Glide-On Eye Pencil - Sparkle Out Loud Collection","ingredients":"Isododecane- Cyclopentasiloxane- Peg\/Ppg-19\/19 Dimethicone- Synthetic Wax- Hydrogenated Polydicyclopentadiene- Calcium Sodium Borosilicate- Nylon-12- C20-40 Alcohols- Perfluorononyl Dimethicone- Silica- Synthetic Fluorphlogopite- Calcium Aluminum Borosilicate- Polyglyceryl-4 Diisostearate\/Polyhydroxystearate\/Sebacate- Polyethylene Terephthalate- Polyethylene- Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate- Acrylates Copolymer- Tin Oxide- Tocopherol- Polyurethane-11. May Contain (+\/-): Mica- Iron Oxides (Ci 77491- Ci 77492- Ci 77499)- Titanium Dioxide (Ci 77891)- Ultramarines (Ci 77007)- Ferric Ammonium Ferrocyanide (Ci 77510)- Copper Powder (Ci 77400)- Aluminum Powder (Ci 77000)- Bronze Powder (Ci 77400)- Carmine (Ci 75470)- Ferric Ferrocyanide (Ci 77510).","details":"What it is: An award-winning- long-lasting- waterproof eyeliner pencil in a wide range of shades.Ingredient Callouts: Free of parabens. This product is also cruelty-free.What Else You Need to Know: 24\/7 Glide-On Eye Pencil applies super-soft for blending- then dries to a long-lasting finish. Line eyes with a hint of color or opt for a dramatic- multi-hued look. The waterproof formula contains 50-percent moisturizing ingredients- making this a holy grail eyeliner that’s a dream to apply.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2235745-main-zoom.jpg?imwidth=930","id":"0140293248"}]