[{"Unnamed: 0":3,"brand":"Lancôme","category":"Mascara","name":"DÉFINICILS - High Definition Mascara","ingredients":"Water- Paraffin- Stearic Acid- Triethanolamine- Cera Alba\/Beeswax\/Cire Dabeille- Acacia Senegal\/Acacia Senegal Gum- Palmitic Acid- Cera- Carnauba\/Carnauba Wax\/Cire De Carnauba- Hydroxyethylcellulose- Panthenol- Imidazolidinyl Urea- Sodium Polymethacrylate- Methylparaben- Propylparaben- Simethicone- Bht- Silica- Polyquaternium-10- [+\/- May Contain: Ci 77499- Ci 77492- Ci 77491 \/ Iron Oxides- Ci 77007 \/Ultramarines- Mica- Ci 77891\/Titanium Dioxide- Ci 75470\/Carmine- Ci 77510\/Ferric Ferrocyanide].","details":"What it is: An iconic mascara that creates clean and defined- natural-looking lashes.What Else You Need to Know: This mascara helps define eyelashes using polymers formulated to lengthen. The fine comb-like brush has a \"hedgehog\" bristles pattern that enables it to dispense the perfect amount of product lash by lash for gradual and even application. ","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s137471-main-zoom.jpg?imwidth=930","id":"0060928336"},{"Unnamed: 0":13,"brand":"Lancôme","category":"Face Primer","name":"LA BASE PRO Perfecting Makeup Primer","ingredients":"Cyclopentasiloxane- Dimethicone Crosspolymer.","details":"What it is: An oil-free face primer that creates a smooth makeup base- absorbs quickly- and leaves skin feeling smooth and soft.What Else You Need to Know: Using Lancôme’s Elasto-Smooth technology- this face primer refines skin’s texture and diffuses light.  It reduces the look of imperfections and creates a smooth base. With its oil-free formulation- this product allows makeup to last all day. It’s also suitable for all skin types.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1103779-main-zoom.jpg?imwidth=930","id":"0375727345"},{"Unnamed: 0":31,"brand":"Urban Decay","category":"Eyeshadow","name":"Eyeshadow","ingredients":" Caprylic\/Capric Triglyceride- Talc- Zinc Stearate- PTFE- Ethylene\/Acrylic Acid Copolymer- Sodium Dehydroacetate- Phenoxyethanol- Sorbic Acid. May contain: CI 77019 (Mica)- CI 77891 (Titanium Dioxide)- CI 77491\/77499 (Iron Oxides).","details":"What it is:An innovative eyeshadow that delivers a high-pigment- velvety finish that lasts.\nWhat it does:This eyeshadow features even softer- velvety texture and richer- more decadent color. Sweep on smoother- more uniform pigment and blendability- and longer-lasting- more crease-free wear. This array of shades features a completely revamped assortment of shadows in new finishes- and a redesigned token compact.\nFormulated with Urban Decay’s Pigment Infusion System™- it acts as a vehicle for color that holds tightly to pigment so that the eyeshadow can glide on seamlessly. It features a proprietary blend of ingredients that allows color to fuse with the formula- resulting in high-impact color that stays on your lids. \nWhat it is formulated WITHOUT:- Parabens- Sulfates- Phthalates\nWhat else you need to know:This new assortment of shades features bestselling favorites- all-new shades- and several shades previously available in past palettes.\n\nEach eyeshadow features packaging that’s inspired by New York City subway tokens. The chromed gunmetal compact has a clear window that allows you to see your shade and easily pop your shadows out and into one of the new customizable palettes.\n","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2417905-main-zoom.jpg?imwidth=930","id":"1400034779"},{"Unnamed: 0":43,"brand":"Urban Decay","category":"Mascara","name":"Perversion Waterproof Mascara","ingredients":"unknown","details":"What it is: A super-intense- blacker-than-black mascara which is now waterproof.Ingredient Callouts: Free of parabens. This product is also cruelty-free.What Else You Need to Know: Urban Decay’s ultra-creamy- lengthening- and volumizing formula coats each lash and never gets brittle or clumpy.  A nurturing blend of proteins- amino acids- and honey extract supports a look of bigger- blacker eyelashes.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2203198-main-zoom.jpg?imwidth=930","id":"044022165X"},{"Unnamed: 0":45,"brand":"Urban Decay","category":"Makeup","name":"Perversion Mascara Mini","ingredients":"Aqua \/ Water- Synthetic Beeswax- Cera Alba \/ Beeswax- Acacia Senegal Gum- Stearic Acid- Palmitic Acid- Glyceryl Stearate- VP\/Eicosene Copolymer- Copernicia Cerifera Cera \/ Carnauba Wax- Polybutene- Butylene Glycol- Stearyl Stearate- Aminomethyl Propanol- Pentylene Glycol- Phenoxyethanol- Caprylyl Glycol- Sodium Dehydroacetate- Paraffin- Potassium Sorbate- Hydroxyethylcellulose- Soluble Collagen- Behenic Acid- Glycerin- Propylene Glycol- Mel Extract \/ Honey Extract- Sodium PCA- Hydrolyzed Elastin- Sorbic Acid- Glycogen- Serine. [+\/- (May contain\/Peut contenir): CI 77499 \/ Iron Oxides]. ","details":"What it is:\nAn ultracreamy- lengthening- and volumizing mascara for stand-out lashes.\nWhat it does:\nPerversion glides on easily to instantly create sexy lashes. It has a creamy- full-bodied texture that is not too dry and not too wet to allow just the right amount of pull as it glides through lashes. This formula is not sticky or clumpy- and it contains Hairdensyl- a complex blend of proteins and amino acids that are known to stimulate lash growth. The honey extract provides deep nourishment- sea idrolized elastine stimulates the hair follicle- and marine collagen protects. The high-tech- volumizing brush separates and defines each lash for a clean- clump-free finish- and the triple-black pigments leave them looking intensely black.\nWhat it is formulated WITHOUT:- Parabens","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1668870-main-zoom.jpg?imwidth=930","id":"0440220602"},{"Unnamed: 0":46,"brand":"Urban Decay","category":"Eyeliner","name":"Perversion Waterproof Liquid Eyeliner","ingredients":"unknown","details":"What it is: A waterproof- liquid eyeliner for cat-eye perfection in just one stroke. Ingredient Callouts: Free of parabens. This product is also cruelty-free.What Else You Need to Know: This innovative brush tip lays down semi-matte- blacker-than-black pigment with precise application. The new- ultra-fine- flexible brush tip gives you full control over your shape and flick. Plus- the waterproof formula keeps on going until you say “when.”","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2203206-main-zoom.jpg?imwidth=930","id":"0440225701"}]