[{"Unnamed: 0":0,"brand":"Lancôme","category":"Foundation","name":"Teint Idole Ultra Long Wear Foundation","ingredients":" -Eternalsoft Polymer: Increases comfort level with long-lasting wear.\n-NAI Pigments: Specially-coated pigments maintain consistent pH level with skin- so color stays true all day.\n-Perlite and Silica: Absorb oil effectively.\n\nWater- Cyclopentasiloxane- Polypropysilsequioxane- Isododecane- Dimethicone- C30-45 Alkyldimethylsilyl- Polypropylsilsequioxane Silica- Glycerin- Peg-10 Dimethicone- Dimethicone\/Polyglycerinej-3 Crosspolymer- Sodium Chloride- Nylon-12- Paraffin- Cyclomethione- Aluminum Hydroxide- Disodium Edta- Disodium Stearoyl Glutamate- Dipropylene Glycol- Disteardimonium Hectorite- Acrylates Copolymer- Phenoxyethanol Chlorphenesin- Ethylparaben- [+\/- May Contain CI 77007 \/ Ultramarines- CI 77491- CI 77492- CI 77499 \/ Iron Oxides- CI 77891 \/ Titanium Dioxide].","details":"What it is: An oil-free- long-wearing- liquid foundation that delivers buildable coverage and leaves a natural-looking- velvety-matte finish for up to 24 hours.Skin Type: Normal- Dry- Combination- and OilyCoverage: Full   Finish: Matte    Formulation: Liquid  Ingredient Callouts: Free of fragrance.  What Else You Need to Know: Teint Idole Ultra Long Wear—now available in 50 shades—is guaranteed to have your shade. In a study with 400 women- 98 percent of participants were able to find their perfect shade match.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2667970-main-zoom.jpg?imwidth=930","id":"0971880107"},{"Unnamed: 0":1,"brand":"Lancôme","category":"Mascara","name":"CILS BOOSTER XL Super-Enhancing Mascara Base","ingredients":"Water- Oryza Sativa Cera\/Rice Bran Wax- Cera Carnauba\/Carnauba Wax\/Cire De Carnauba- Cera Alba\/Beeswax\/Cire D'abeille- Stearic Acid- Candelilla Cera\/Candelilla Wax\/Cire De Candelilla- Triethanolamine- Palmitic Acid- Acacia Senegal\/Acacia Senegal Gum- Panthenol- Sodium- Polymethacrylate- Hydroxyethylcellulose- Propylparaben- Peg\/Ppg-17\/18 Dimethicone- Methylparaben- Simethicone- Rayon- Polyquaternium-10- Tocopheryl Acetate- Polycaprolactone.","details":"What it is: \nA lash-conditioning mascara primer to maximize mascara results—creating even longer-looking and more volumized lashes.\nHighlighted Ingredients: - Vitamin E and Micro-Fibers: Condition lashes.What Else You Need to Know: With just one sweep- this iconic mascara primer evenly coats lashes to maximize the results of your favorite mascara. The conditioning formula- infused with micro-fibers and vitamin E- adds a look of extra length and thickness to lashes. At night- this can also be used as a lash mask to nurture lashes.Clinical Results: In a consumer test with a panel of 103 women using CILS BOOSTER and their regular mascara:- 93% saw more length- 92% saw more volume- 85% saw more curl\n","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2109965-main-zoom.jpg?imwidth=930","id":"0316666343"},{"Unnamed: 0":4,"brand":"Lancôme","category":"Makeup Removers","name":"Bi-Facil Double-Action Eye Makeup Remover","ingredients":"Aqua\/Water- Cyclopentasiloxane- Isohexadecane- Sodium Chloride- Poloxamer 184- Hexylene Glycol- Dipotassium Phosphate- Benzyl Alcohol- Potassium Phosphate- Quaternium-15- Benzalkonium Chloride- Parfum \/ Fragrance- Citronellol- Geraniol. ","details":"What it is:  An award-winning eye makeup remover that is gentle enough for sensitive skin and contact-lens-wearers.Skin Type: Normal- Dry- Combination- and Oily Formulation: Liquid What Else You Need to Know:  Shake this bi-phase makeup remover before use to activate it. The lipid phase lifts eye makeup off- while the water phase uses unique emollients to effortlessly remove eye makeup residue. It leaves skin feeling perfectly cleansed. It is as fresh as water with a no-rinse formula.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s534628-main-zoom.jpg?imwidth=930","id":"0312195516"},{"Unnamed: 0":31,"brand":"Urban Decay","category":"Eyeshadow","name":"Eyeshadow","ingredients":" Caprylic\/Capric Triglyceride- Talc- Zinc Stearate- PTFE- Ethylene\/Acrylic Acid Copolymer- Sodium Dehydroacetate- Phenoxyethanol- Sorbic Acid. May contain: CI 77019 (Mica)- CI 77891 (Titanium Dioxide)- CI 77491\/77499 (Iron Oxides).","details":"What it is:An innovative eyeshadow that delivers a high-pigment- velvety finish that lasts.\nWhat it does:This eyeshadow features even softer- velvety texture and richer- more decadent color. Sweep on smoother- more uniform pigment and blendability- and longer-lasting- more crease-free wear. This array of shades features a completely revamped assortment of shadows in new finishes- and a redesigned token compact.\nFormulated with Urban Decay’s Pigment Infusion System™- it acts as a vehicle for color that holds tightly to pigment so that the eyeshadow can glide on seamlessly. It features a proprietary blend of ingredients that allows color to fuse with the formula- resulting in high-impact color that stays on your lids. \nWhat it is formulated WITHOUT:- Parabens- Sulfates- Phthalates\nWhat else you need to know:This new assortment of shades features bestselling favorites- all-new shades- and several shades previously available in past palettes.\n\nEach eyeshadow features packaging that’s inspired by New York City subway tokens. The chromed gunmetal compact has a clear window that allows you to see your shade and easily pop your shadows out and into one of the new customizable palettes.\n","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2417905-main-zoom.jpg?imwidth=930","id":"1400034779"},{"Unnamed: 0":36,"brand":"Urban Decay","category":"Lip Liner","name":"24\/7 Glide-On Lip Pencil","ingredients":"Cyclopentasiloxane- Polybutene- Synthetic Wax- Isododecane- Simmondsia Chinensis Seed Oil \/ Jojoba Seed Oil- Hydrogenated Cottonseed Oil- Ceresin- Ozokerite- Cera Microcristallina \/ Microcrystalline Wax \/ Cire Microcristalline- Phenoxyethanol- Alumina- Tocopherol- Calcium Aluminum Borosilicate- Barium Sulfate- Ascorbyl Palmitate- Colophonium \/ Rosin \/ Colophane- Silica- Tin Oxide. [+\/- (May contain\/Peut contenir): Mica- CI 77891 \/ Titanium Dioxide- CI 77491- CI 77492- CI 77499 \/ Iron Oxides- CI 15850 \/ Red 7- CI 45410 \/ Red 28 Lake- CI 15850 \/ Red 7 Lake- CI 15850 \/ Red 6- CI 77163 \/ Bismuth Oxychloride- CI 77742 \/ Manganese Violet- CI 15985 \/ Yellow 6 Lake- CI 42090 \/ Blue 1 Lake- CI 19140 \/ Yellow 5 Lake- CI 75470 \/ Carmine- CI 73360 \/ Red 30]. ","details":"What it is:\nA creamy- 24-hour wear lip pencil that lines and primes lips.\n\nWhat it does:\n Get primed and ready with Urban Decay’s 24\/7 Glide-On Lip Pencil. This long-lasting- waterproof liner glides on smoothly to prime and define lips for long-lasting lip color and clean lines. It features a wide array of shades that coordinate with Vice Lipstick.\n\nUse 24\/7 Lip Pencil to fill in your lips completely- prime them for lipstick or gloss- and lock onto color. It even prevents color from feathering out of bounds. The waterproof formula glides on smoothly- stays creamy- and defines your lips with gorgeous color- while never feeling dry or cakey. Formulated with moisturizing vitamin E- jojoba oil- and cottonseed oil- it nourishes lips every time you apply.\n\nWhat else you need to know:\n The shade-matched barrels make it easy to find the exact color you need.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1724921-main-zoom.jpg?imwidth=930","id":"0345361792"},{"Unnamed: 0":40,"brand":"Urban Decay","category":"Makeup","name":"De-Slick Oil-Control Makeup Setting Spray Mini","ingredients":"Water- Alcohol Denat.- PVP- Dimethicone PEG-7 Phosphate- PPG-3 Benzyl Ether Myristate- Polyhydroxystearic Acid- Dipropylene Glycol- Isononyl Isononanoate- Ethylhexyl Isononanoate- Caprylyl Glycol- Sodium Cocamidopropyl PG-Dimonium Chloride Phosphate- Methyl Methacrylate Crosspolymer- Glycereth-5 Lactate- Sodium Hydroxide- Phenylpropanol- Fragrance- Propanediol- Methyl Diisopropyl Propionamide- Poloxamer 407- Aloe Barbadensis Leaf Juice Powder- Maltodextrin- Hexyl Cinnamal- Linalool- Citronellol- Limonene- Benzyl Alcohol- Tocopherol- Potassium Sorbate- Sodium Benzoate- BHT.","details":"What it is: A setting and finishing spray that keeps makeup looking just-applied- delivers oil control- and deflects shine for a matte complexion that lasts. Ingredient Callouts: Free of phthalates. This product is also vegan and cruelty-free.What Else You Need to Know: Made with Urban Decay’s patented Temperature Control Technology- this oil-free- microfine mist lowers the temperature of your makeup to keep foundation- concealer- shadow- and blush from smudging- sliding- or fading.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1900703-main-zoom.jpg?imwidth=930","id":"0385484518"}]