[{"Unnamed: 0":4855,"brand":"Lancôme","category":"Moisturizers","name":"Hydra Zen Anti-Stress Moisturizing Face Cream","ingredients":"Aqua\/Water- Glycerin- Dimethicone- Isononyl Isononanoate- Butylene Glycol- Cetyl Alcohol- Stearyl Dimethicone- Glyceryl Stearate- Stearic Acid- Stearyl Alcohol- Peg-8 Stearate- Synthetic Wax- Ci 14700\/Red 4- Sodium Dextran Sulfate- Sodium Hydroxide- Phenoxyethanol- Theobroma Cacao Extract\/Cocoa Extract- Paeonia Suffruticosa Extract\/Paeonia Suffruticosa Root Extract- Peg-100 Stearate- Eugenol- Ophiopogon Japonicus Root Extract- Ethylparaben- Palmitic Acid- Silica- Ammonium Polyacryldimethyltauramide\/Ammonium Polyacryloyldimethyl Taurate- Dimethiconol- Limonene- Benzyl Alcohol- Benzyl Benzoate- Caprylyl Glycol- Alpha-Isomethyl Ionone- Moringa Pterygosperma Seed Extract- Disodium Edta- Jasminum Officinale Extract\/Jasmine Flower Extract- Rosa Gallica Extract\/Rosa Gallica Flower Extract- Methylparaben- Citronellol- Alteromonas Ferment Extract- Parfum\/Fragrance- Ethylhexylglycerin. ","details":"What it is:  A hydrating daytime face cream- ideal for dry and sensitive skin types- to keep skin feeling refreshed- replenished- and looking radiant. Skin Type: Normal- Dry- Combination- and Oily  Skincare Concerns: Dryness- Dullness- and Uneven Texture Formulation: Cream What Else You Need to Know: Each day environmental aggressors can affect skin. With its creamy texture and a delicate fragrance- this moisturizer helps to comfort skin- leaving it feeling replenished- soothed- and looking more luminous.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1971274-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":8481,"brand":"Urban Decay","category":"Lipstick","name":"Vice Lipstick","ingredients":" Octyldodecanol- Isodecyl Neopentanoate- Kaolin- Cetyl Ricinoleate- Butyrospermum Parkii Oil \/ Shea Oil- Aluminum Starch Octenylsuccinate- Candelilla Cera \/ Candelilla Wax- Cetyl Lactate- Cera Alba \/ Beeswax- Cera Microcristallina \/ Microcrystalline Wax- Polyethylene- Dimethicone\/Bis-Isobutyl Ppg-20 Crosspolymer- Aqua \/ Water- Octyldodecyl Neopentanoate- Caprylyl Glycol- Calcium Sodium Borosilicate- Aluminum Hydroxide- Alumina- Pentaerythrityl Tetra-di-t-Butyl Hydroxyhydrocinnamate- Silica- Tocopherol- Tocopheryl Acetate- Colophonium \/ Rosin- Glycine Soja Oil \/ Soybean Oil- Squalane- Orbignya Oleifera Seed Oil- Simmondsia Chinensis Seed Oil \/ Jojoba Seed Oil- Ascorbyl Palmitate- Theobroma Cacao Seed Butter \/ Cocoa Seed Butter- Persea Gratissima Oil \/ Avocado Oil- Shorea Stenoptera Seed Butter- Butyrospermum Parkii Butter \/ Shea Butter- Tin Oxide- Aloe Barbadensis Leaf Extract- Synthetic Fluorphlogopite- Calcium Aluminum Borosilicate- Polyethylene Terephthalate- Citric Acid- Polylactic Acid. [+\/- (May Contain\/Peut contenir): CI 77891 \/ Titanium Dioxide- CI 77491- CI 77492- CI 77499 \/ Iron Oxides- Mica- CI 15850 \/ Red 7 Lake- CI 77120 \/ Barium Sulfate- CI 45410 \/ Red 28 Lake- CI 15850 \/ Red 6- CI 19140 \/ Yellow 5 Lake- CI 15985 \/ Yellow 6 Lake- CI 42090 \/ Blue 1 Lake- CI 17200 \/ Red 33 Lake- CI 75470 \/ Carmine].","details":"What it is: An innovative lip formula- in an array of shades and finishes- that gives an unbelievable laydown of color with just one swipe.What it does: Vice Lipstick features six indulgent finishes  and array of addictive shades that range from bold brights to dark hues to versatile neutrals. Each shade applies smoothly (without dragging or skipping)- hugs lips- and feels ultra-comfortable. Urban Decay’s proprietary Pigment Infusion System™ gives the formula its super-creamy texture- rich payout- and superior color dispersion. What else you need to know: This creamy formula is packed with nourishing ingredients. A butter blend comforts- hydrates- and enhances- leaving lips soft and conditioned- and never dry. Aloe vera- jojoba- avocado- and babassu oils nourish and soften lips. Illipe butter- derived from Malaysian illipe trees- provides long-lasting moisture- while the vitamins C and E deliver a hint of antioxidants.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2481943-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":68,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift radiant smoothing wet cleansing towelettes","ingredients":"Active Ingredients  AQUA \/ WATER • GLYCERIN • ISOPROPYL PALMITATE • PENTYLENE GLYCOL • ALCOHOL DENAT • PEG-100 STEARATE • GLYCERYL STEARATE • CETYL ALCOHOL • CARBOMER •  TRIETHANOLAMINE • ACETYL TRIFLUOROMETHYLPHENYL VALYLGLYCINE • ASCORBYL GLUCOSIDE • CAPRYLOYL SALICYLIC ACID • XANTHAN GUM • DISODIUM COCOAMPHODIACETATE • DISODIUM EDTA • METHYLPARABEN • QUATERNIUM-15 •  PARFUM \/ FRAGRANCE • LINALOOL • BENZYL SALICYLATE • CITRONELLOL •  ALPHA-ISOMETHYL IONONE • GERANIOL • LIMONENE • COUMARIN • HYDROXYISOHEXYL 3-CYCLOHEXENE CARBOXALDEHYDE • BUTYLPHENYL METHYLPROPIONAL","details":"New RevitaLift® Radiant Smoothing Wet Cleansing Towelettes are specially formulated to nourish skin and boost radiance while gently exfoliating and removing all traces of impurities and makeup. Skin looks smoother, brighter and more refined.\n\n\n-Containing Revitalizing Vitamin C, these towelettes help remove all traces of makeup and impurities.\n-Gently exfoliates skin dead cells and helps enhance skin smoothness and radiance.\n-When used as part of a complete skincare regimen, it complements the performance of your daily RevitaLift anti-aging moisturizer action.\n\n\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-cleansers\/revitalift-radiant-smoothing-wet-cleansing-towelettes\/radiant-smoothing-wet-cleansing-towelettes\/071249135631_t1-2.png"}]