[{"Unnamed: 0":4807,"brand":"Lancôme","category":"Moisturizers","name":"UV Expert Aquagel Defense Primer & Moisturizer SPF 50","ingredients":" -Vitamin E: A potent antioxidant that helps improve skin. -Moringa Extract: A potent antioxidant that helps improve skin. -Edelweiss Extract: A potent antioxidant that helps improve skin.  Avobenzone 3%- Homosalate 10.7%- Octisalate 3.2%- Octocrylene 6%- Oxybenzone 3.9%.- Water- Dimethicone- Alcohol Denat.- Styrene\/Acrylates Copolymer- Acrylates\/Dimethicone Copolyme- Tocophero- Sodium Polyacrylate- Sodium Dodecylbenzenesulfonate- Sodium Benzoate- Phenoxyethanol- Peg-8 Laurate- Silica- Pentylene Glycol- Mentha Piperita (Peppermint) Extract- Propylene Glycol- Leontopodium Alpinum Flower\/Leaf Extract- Caprylyl Glycol- Acrylates\/C10-30 Alkyl Acrylate Crosspolyme- Sorbitol- Moringa Oleifera Seed Extract- Disodium Edta- Rosa Gallica Flower Extract- Disodium Phosphate- Citric Acid- Potassium Sorbate- Glycerin- Fragrance.","details":"What it is:  A primer- moisturizer- and sunscreen that hydrates- primes- and protects skin.Skin Type: Normal- Dry- Combination- and Oily Skincare Concerns: DrynessFormulation: GelHighlighted Ingredients:- Vitamin E: A potent antioxidant that helps improve skin. - Moringa Extract: A potent antioxidant that helps improve skin. - Edelweiss Extract: A potent antioxidant that helps improve skin.  Ingredient Callouts: Free of sulfates SLS and SLES- formaldehydes- formaldehyde-releasing agents- phthalates- mineral oil- retinyl palmitate- coal tar- hydroquinone- triclosan- and triclocarban- and contains less than one percent of synthetic fragrances.  What Else You Need to Know:  Sun damage is known to cause first signs of aging. This all-in-one moisturizer with SPF 50 UVA\/UVB protection gives lasting hydration and helps protect skin against sun damage. The cooling Aquagel texture transforms into a water-like gel that's easy to blend and is translucent on skin. This formula is not heavy- greasy or sticky- and it won't clog pores. It’s suitable for all skin types- including sensitive skin. ","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2186773-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":22,"brand":"L'Oreal Paris","category":"Skincare","name":"Age perfect rosy tone broad spectrum spf 30 sunscreen","ingredients":"Always read the ingredient list on the product label before use. Please consult the product packaging on the shade level at your local store for detailed product ingredients and application instructions.\nAVOBENZONE 3%, HOMOSALATE\t2.7%, OCTISALATE\t5%, OCTOCRYLEN 7%, COSMETIC \nWATER\nGLYCERIN\nCETEARYL ALCOHOL \nISOHEXADECANE\nGLYCERYL STEARATE \nCYCLOHEXASILOXANE\nISONONYL ISONONANOATE\nBUTYROSPERMUM PARKII (SHEA) BUTTER\nPEG-100 STEARATE\nBUTYLENE GLYCOL\nCETEARETH-20\nPHENOXYETHANOL \nSYNTHETIC FLUORPHLOGOPITE\nAMMONIUM POLYACRYLOYLDIMETHYL TAURATE\nCAPRYLYL GLYCOL\nTOCOPHEROL\nCHLORPHENESIN \nXANTHAN GUM\nDISODIUM EDTA\nTITANIUM DIOXIDE\nMICA\nFRAGRANCE \nP-ANISIC ACID\nPAEONIA ALBIFLORA ROOT EXTRACT\nBISMUTH OXYCHLORIDE\nIRON OXIDES\nADENOSINE\nIRIS FLORENTINA ROOT EXTRACT \nSODIUM HYDROXIDE\nTIN OXIDE\nHEXYL CINNAMAL \nBENZYL ALCOHOL\nHYDROXYCITRONELLAL \nBENZYL SALICYLATE\nLINALOOL\nCITRONELLOL \nLIMONENE\nGERANIOL\nALPHA-ISOMETHYL IONONE\nCITRIC ACID\n\nFIL CODE D235093\/1  ","details":"Rosy Tone Broad Spectrum SPF 30 Sunscreen is a daily face moisturizer for mature skin and dull tone. The formula with Imperial Peony renews & revives healthy tone for visibly younger looking skin. After use, skin immediately is hydrated and feels soft and skin appears healthier. In 1 week skin feels smooth and appears more radiant.  Paraben free, mineral oil free, dye free, allergy tested.\nPackaging may vary, what you receive may not be what is reflected on site.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/face\/age-perfect-rosy-tone-broad-spectrum-spf-30-sunscreen\/rosy-tone-broad-spectrum-spf-30-sunscreen\/071249395394_t1.png"},{"Unnamed: 0":27,"brand":"L'Oreal Paris","category":"Skincare","name":"Bright reveal spf 50 invisible uv fluid","ingredients":"Bright Reveal SPF 50 Daily UV Lotion is suitable for all skin types, including sensitive skin, mature skin and combination skin.\n","details":"Bright Reveal SPF 50 Daily UV Lotion is your key to glowy and protected skin. Formulated with UVA and UVB filters to provide broad spectrum protection from sun rays that cause aging and burning, it includes vitamin C and vitamin E to also help protect against environmental damage caused by free radicals that can accelerate the appearance of aging signs. Skin immediately feels fresh and moisturized and over time skin looks brighter, tone looks more even and fine lines are visibly reduced. Additional results and benefits include:\n\nInvisible, lightweight, non-greasy texture\n96% of participants said product does not leave a white cast* (*in a consumer study of 86 women)\nBlends well with all skin tones\nSuitable for all skin types, including sensitive skin and mature skin\nPrimes well for makeup\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-derm-intensives-broad-spectrum-spf-50-invisible-uv-fluid\/071249683491-t1.png"},{"Unnamed: 0":35,"brand":"L'Oreal Paris","category":"Skincare","name":"Derm intensives 5 percent glycolic acid toner","ingredients":"Aqua \/ Water \/ Eau, Glycolic Acid, Hydroxyethylpiperazine Ethane Sulfonic Acid, Glycerin, Sodium Hydroxide, Citric Acid, Pentylene Glycol, Aloe Barbadensis Leaf Juice, Citrullus Lanatus Fruit Extract \/ Watermelon Fruit Extract, Allantoin, Ascorbyl Glucoside, Panthenol, Tocopherol, Bis-Peg-18 Methyl Ether Dimethyl Silane, Potassium Sorbate, Salicylic Acid, Sodium Benzoate Fil #B274432\/1\n","details":"The secret to smooth and glowing skin? Gentle exfoliation in 1 simple step! NEW Revitalift Derm Intensives 5% Pure Glycolic Acid Toner, a daily peeling toner that smooths skin texture and reveals glowing, smoother, brighter skin\n\nHow It Works- Formulated with 5 Percent Pure Glycolic Acid to increase cell turnover, Infused with Aloe Vera to soothe and moisturize the skin for gentle and effective daily exfoliation\nWhat's New- Dermatologist- Validated formula with 5 percent Pure Glycolic Acid and Aloe Vera, Effective concentration designed for daily use, Suitable for all skin types, even sensitive, Effective for all skin tones\nVisible Results- Immediately skin feels smoother, refreshed and clean- In 1 week, skin feels softer and looks renewed with a healthy glow, Overtime, appearance of dark spots is reduced\n\nFragrance free, Paraben and Alcohol free, Allergy Tested, Mineral Oil and Dye Free, Pair with your Revitalift Derm Intensives Serum and Revitalift Triple Power SPF 30 Moisturizer in the AM to protect skin from sun exposure.\n\n*An external panel of dermatologists validated that Revitalift Derm Intensives products uphold strict formulation standards and reviewed independent clinical testing results and protocols.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/glycolic-serum\/derm-intensives-5-percent-glycolic-acid-toner\/lorealskincarerevitaliftdermintensives5glycolicacidtonerfront-4.png"},{"Unnamed: 0":37,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift derm intensives 10 pure glycolic acid serum","ingredients":"AQUA \/ WATER \/ EAU\nGLYCOLIC ACID\nGLYCERIN\nALCOHOL DENAT.\nSODIUM HYDROXIDE\nALOE BARBADENSIS LEAF JUICE\nSODIUM HYALURONATE\nHYDROXYETHYLCELLULOSE\nASCORBYL GLUCOSIDE\nCITRIC ACID\nPOTASSIUM SORBATE\nSODIUM BENZOATE\n\nFIL CODE  D235027\/1","details":"Validated in partnership with an external panel of dermatologists, 10% Pure Glycolic Acid Serum absorbs quickly to visibly even skin tone and reduce wrinkles, fine lines & dark spots.\n\nGlycolic Acid is an alpha hydroxy acid (AHA) recognized by dermatologists as an effective resurfacing agent for even and younger-looking skin. This daily use face serum is specially blended with Aloe - a plant-derived\/botanical extract, renowned for its soothing benefits. Immediately, after applying face serum skin feels smoother and visibly refined. After 1 week of using serum, skin is resurfaced and younger-looking. Over time, skin tone is more visibly even and dark spots & wrinkles are visibly reduced. This serum is fragrance free, paraben free, mineral oil free, dye free, allergy tested. Products with Glycolic Acid may increase photosensitivity. Apply Revitalift Triple Power SPF 30 broad spectrum face moisturizer the morning after use of serum.\nSee results or your money back, guaranteed.\n*Money back guarantee, up to $36.99 (sales tax and shipping not refunded), for L’Oréal Paris Revitalift Triple Power or Derm Intensives skin care product. Purchase between 1\/1\/2020-12\/31\/20 redeem by 1\/30\/21. Restrictions apply. For details, call 1-855-332-9983.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/face-serums\/revitalift-derm-intensives-10-pure-glycolic-acid-serum\/lorealparisusa-derm-intensive-pure-glycolic-acid-serum-pdp.png"},{"Unnamed: 0":39,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift triple power anti aging moisturizer fragrance free","ingredients":"*Ingredient list may vary. Please look at ingredient list printed on the product carton for the latest.\nAQUA \/ WATER \/ EAU\nGLYCERIN\nISOHEXADECANE\nISOPROPYL ISOSTEARATE\nNIACINAMIDE\nALUMINUM STARCH OCTENYLSUCCINATE\nNYLON-12\nDIMETHICONE\nCETYL ALCOHOL\nPOLYETHYLENE\nSTEARYL ALCOHOL\nCETEARYL ALCOHOL\nSTEARIC ACID\nBEHENYL ALCOHOL\nPHENOXYETHANOL\nSYNTHETIC FLUORPHLOGOPITE\nPALMITIC ACID\nPOLYACRYLAMIDE\nCAPRYLOYL SALICYLIC ACID\nSODIUM ACRYLATES COPOLYMER\nCAPRYLIC\/CAPRIC TRIGLYCERIDE\nCI 77891 \/ TITANIUM DIOXIDE\nPEG-100 STEARATE\nCAFFEINE\nASCORBYL GLUCOSIDE\nC13-14 ISOPARAFFIN\nCETEARYL GLUCOSIDE\nDIMETHICONOL\nTOCOPHEROL\nSODIUM HYALURONATE\nRETINYL PALMITATE\nDISODIUM EDTA\nSODIUM HYDROXIDE\nLAURETH-7\nADENOSINE\nMYRISTIC ACID\nPEG-30 DIPOLYHYDROXYSTEARATE\nSORBITAN OLEATE\nTIN OXIDE\nCETEARETH-6 \n\nFIL CODE D233940\/1","details":"DON’T SETTLE FOR JUST HYDRATION. Revitalift Triple Power Fragrance Free Moisturizer is formulated with 3 of the top dermatologist-recommended ingredients: Hyaluronic Acid, Vitamin C, and Pro-Retinol to visibly reduce wrinkles, firm and brighten skin in 1 week. After use, skin feels softer, smoother, and hydrated for 24 hours.\n\nWHY CHOOSE TRIPLE POWER? Revitalift Triple Power Fragrance Free Moisturizer is formulated with top 3 powerful, dermatologist-recommended ingredients:\n• Hyaluronic Acid: A potent hydration-attracting molecule naturally found in skin to enhance and retain moisture levels.\n• Vitamin C: A vital antioxidant naturally found in skin, known to boost radiance, even tone and neutralize free radicals that can lead to signs of aging.\n• Pro-Retinol: A gentle, stabilized derivative of retinol that works with other ingredients in the formula to visibly reduce wrinkles and firm.\n\nSEE VISIBLE RESULTS. Immediately, skin feels softer, smoother, plumped and hydrated for 24 hours. In 1 week, wrinkles are visibly reduced and firmness is noticeably improved. Skin tone is brighter and more radiant. \n\nFOR EVERYDAY USE. Revitalift Triple Power Fragrance Free Moisturizer is dermatologist-tested for safety, non-greasy, absorbs quickly, and is suitable for sensitive skin and everyday use. Paraben free, mineral oil free, dye free, allergy-tested. Also available in Fragranced and Broad-Spectrum SPF 30 Sunscreen.\n\nTHE ANTI-WRINKLE POWER DUO. Pair Triple Power Fragrance Free Moisturizer with 1.5% PURE Hyaluronic Acid Serum for an added boost of hydration and visibly reduced wrinkles for younger-looking skin.\n\nPRO TIP. Revitalift Triple Power Fragrance Free Moisturizer is specially formulated to layer well under makeup without clogging pores. Smooth this cream until thoroughly absorbed to use as a primer and create the perfect moisturized base before makeup.\n\nSee results or your money back, guaranteed.\n*Money back guarantee, up to $36.99 (sales tax and shipping not refunded), for L’Oréal Paris Revitalift skin care products. Purchase between 1\/1\/2021-12\/31\/21 redeem by 1\/29\/22. Restrictions apply. For details, call 1-855-332-9983.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-triple-power-anti-aging-moisturizer-fragrance-free\/revitalift-triple-power-day-cream-fragrance-free\/071249396339_t1.png"},{"Unnamed: 0":40,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift triple power day lotion spf 30","ingredients":"*Ingredient list may vary. Please look at ingredient list printed on the product carton for the latest.\nRevitalift Triple Day Lotion SPF 30  Formula 917113\/14\nACTIVE INGREDIENTS \nAVOBENZONE 3%\nHOMOSALATE 5%\nOCTISALATE\t5%\nOCTOCRYLENE 7%\nCOSMETIC INGREDIENTS \nWATER\nGLYCERIN\nNIACINAMIDE\nSILICA\nDIMETHICONE\nPEG-100 STEARATE\nGLYCERYL STEARATE\nSTEARIC ACID\nPHENOXYETHANOL\nAMMONIUM POLYACRYLOYLDIMETHYL TAURATE\nPALMITIC ACID\nCAFFEINE\nDICAPRYLYL CARBONATE\nSTEARETH-100\nPHENYLETHYL RESORCINOL\nCAPRYLOYL SALICYLIC ACID\nCAPRYLYL GLYCOL\nXANTHAN GUM\nDIMETHICONE\/VINYL DIMETHICONE CROSSPOLYMER\nASCORBYL GLUCOSIDE\nDISODIUM EDTA\nTOCOPHEROL\nBISABOLOL\nSODIUM HYALURONATE\nRETINYL PALMITATE\nFRAGRANCE\nSODIUM HYDROXIDE\nMYRISTIC ACID\nFARNESOL\nBENZYL SALICYLATE\nBENZYL ALCOHOL\nCOUMARIN\nLINALOOL\nFIL CODE D235101\/1","details":"Revitalift Triple Power Broad Spectrum SPF 30 Sunscreen is an anti-aging face moisturizer, formulated with Pro-Retinol, Vitamin C and Hyaluronic Acid  to reduce wrinkles, firm and brighten in 1 week. After use skin feels smoothed, softer, refreshed. Dermatologist tested, suitable for sensitive skin. Paraben free, mineral oil free, dye free, allergy tested.\nSee results or your money back, guaranteed.\nMoney back guarantee, up to $29.99 (sales tax will not be refunded). Restrictions apply. For details, call 1-800-630-5585. Valid in the 50 U.S\/D.C. and only on purchase of a Revitalift Triple Power or Derm Intensives skin care product made between 1\/1\/18 and 12\/31\/19 with original store receipt. Request must be postmarked by 1\/31\/20 and received by 2\/14\/20. Void where prohibited. Limit 1 refund per person and per household.\nPackaging may vary.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/face\/revitalift-triple-power-day-lotion-spf-30\/071249396346_t1.png"},{"Unnamed: 0":51,"brand":"L'Oreal Paris","category":"Skincare","name":"Collagen expert day moisturizer with spf 30","ingredients":"917152 18 - Ingredients:  Water, Glycerin, Dimethicone, Niacinamide, Silica, Alcohol Denat., Octyldodecanol, Isopropyl Isostearate, Behenyl Alcohol, Phenoxyethanol, Butylene Glycol, Acrylamide\/Sodium Acryloyldimethyltaurate Copolymer, Tocopherol, Aluminum Starch Octenylsuccinate, Ammonium Acryloyldimethyltaurate\/Steareth-25 Methacrylate Crosspolymer, Cetyl Alcohol, Dimethicone\/Vinyl Dimethicone Crosspolymer, Dimethiconol, Peg-100 Stearate, Capryloyl Salicylic Acid, Isohexadecane, Cetearyl Alcohol, Trisodium Ethylenediamine Disuccinate, Carbomer, Fragrance, Sodium Hyaluronate, Ethylhexylglycerin, Polysorbate 80, Cetearyl Glucoside, Sorbitan Oleate, Sodium Lactate, Sodium Hydroxide, Polysorbate 20, Citronellol, Limonene, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7 Fil V279603\/1\n","details":"RETIGHTENED, DENSER, MORE EVEN SKIN! Age Perfect Collagen Expert Day Moisturizer provides a daily boost of Collagen Peptides + Niacinamide to intensely rehydrate and redensify maturing skin. Formulated with Broad Spectrum SPF 30 Sunscreen, this formula also helps protect against two types of UV rays (UVA\/UVB) that cause skin damage and premature aging. Paraben free. Mineral oil free. Allergy tested. Suitable for even sensitive skin.\n\nWHAT IS COLLAGEN? Collagen is a natural protein abundantly present in the skin. It provides skin’s strength, firmness, and bounce. After 50, the skin’s collagen production slows which can lead to loss of volume and sagging.\n\nWHAT ARE PEPTIDES? Recommended by dermatologists, peptides are the building blocks of collagen and are key for its natural production in the skin. Our collagen peptides, along with the other ingredients in our powerful formula, help lock in moisture, redensify and retighten skin.\n\nWHAT IS NIACINAMIDE? Also known as Vitamin B3, this essential nutrient helps to brighten skin overall and to reduce age spots.\n\nVISIBLE RESULTS After 1 use, skin is intensely rehydrated and nourished. After 4 weeks, skin feels stronger, denser and contours appear more toned. Skin’s radiance and brightness also improve, while overall complexion appears healthier.\n\nHYDRATING, NON-GREASY TEXTURE: This lightweight face cream provides all-day hydration. It absorbs quickly and doesn’t leave a greasy or sticky finish.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/collagen-expert-day-moisturizer-with-spf-30\/loreal-skin-age-perfect-anti-sagging-even-tone-collagen-expert-moisturizer-spf-primary.png"},{"Unnamed: 0":52,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift anti wrinkle firming day cream spf 25","ingredients":"AQUA \/ WATER • CYCLOHEXASILOXANE • ETHYLHEXYL METHOXYCINNAMATE • GLYCERIN • MYRISTYL MYRISTATE  • PHENYLBENZIMIDAZOLE SULFONIC ACID • ALCOHOL DENAT. • TRIETHANOLAMINE • STEARIC ACID • AMMONIUM POLYACRYLDIMETHYLTAURAMIDE \/ AMMONIUM • POLYACRYLOYLDIMETHYL TAURATE • PALMITIC ACID • TITANIUM DIOXIDE • PEG-100 STEARATE • CERA ALBA \/ BEESWAX • GLYCERYL STEARATE • PEG-20 STEARATE • STEARYL ALCOHOL • GLYCINE SOJA PROTEIN \/ SOYBEAN PROTEIN • ALUMINA • PHENETHYL ALCOHOL • HYDROLYZED SOY PROTEIN • ACETYL TRIFLUOROMETHYLPHENYL VALYLGLYCINE • FAEX EXTRACT \/ YEAST EXTRACT • ACRYLATES COPOLYMER • CETYL ALCOHOL • RETINYL PALMITATE • POTASSIUM SORBATE • METHYLPARABEN • SODIUM BENZOATE • PHENOXYETHANOL • CHLORPHENESIN • ETHYLPARABEN • LINALOOL • GERANIOL • ALPHA-ISOMETHYL IONONE • AMYL CINNAMAL • LIMONENE • CITRAL • CITRONELLOL • BUTYLPHENYL METHYLPROPIONAL • HEXYL CINNAMAL • BENZYL ALCOHOL • BENZYL BENZOATE • BENZYL CINNAMATE • BENZYL SALICYLATE • PARFUM \/ FRAGRANCE","details":"Experience advanced action against the signs of aging. RevitaLift Anti-Wrinkle + Firming Cream SPF 25, a unique daily moisturizer with broad spectrum UVA\/UVB SPF 25 sunscreen protection, delivers smoother, firmer skin in just 4 weeks. Fortified with Pro-Retinol A and Stimuplex, Revitalift Anti-Wrinkle + Firming works to increase cell turnover, reduce wrinkles, firm skin, and provide 24-hour hydration.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-anti-wrinkle-firming-day-cream-spf-25\/anti-wrinkle-firming-day-cream-spf-25\/071249104583_t1.png"},{"Unnamed: 0":93,"brand":"L'Oreal Paris","category":"Skincare","name":"Men expert vita lift anti wrinkle firming moisturizer","ingredients":"AQUA \/ WATER\nGLYCERINCYCLOHEXASILOXANE\nCAPRYLIC\/CAPRIC TRIGLYCERIDE\nDIMETHICONEALUMINUM STARCHOCTENYLSUCCINATE\nCYCLOPENTASILOXANEPEG-100 STEARATEGLYCERYL STEARATE\nBUTYROSPERMUM PARKII BUTTER \/ SHEA BUTTERMENTHA PIPERITA EXTRACT \/ PEPPERMINT LEAF EXTRACTC12-13 PARETH-23\nC12-13 PARETH-3STEARIC ACID\nTRIETHANOLAMINEDIMETHICONOL\nLITHIUM MAGNESIUM SODIUMSILICATESODIUM CITRATE\nSILICADIVINYLDIMETHICONE\/DIMETHICONECOPOLYMERPALMITIC ACID\nASCORBYL GLUCOSIDEAMMONIUM POLYACRYLDIMETHYLTAURAMIDE \/ AMMONIUMPOLYACRYLOYLDIMETHYL TAURATE\nXANTHAN GUM\nPISUM SATIVUM EXTRACT \/ PEA EXTRACTACRYLATES COPOLYMER\nCETYL ALCOHOLBUTYLENE GLYCOL\nRETINYL PALMITATEIMIDAZOLIDINYL UREAMETHYLPARABEN\nPHENOXYETHANOLBUTYLPARABEN\nLINALOOLLIMONENEPARFUM \/ FRAGRANCEPOTASSIUM SORBATE\nCHLORPHENESIN","details":"Men Expert Vita Lift SPF 15 Anti-Wrinkle & Firming Moisturizer is formulated specifically for wrinkles, sagging skin, or loss of firmness. Fortified Pro-Retinol A, a form of Vitamin A, helps reduce wrinkles and sagging skin while firming up the face and neck. Active Defense System (ADS) , our patented system that protects your skin against irritation, so you’re less likely to get redness, burning, or tightness.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/men-expert-vita-lift-anti-wrinkle-firming-moisturizer\/vita-lift-anti-wrinkle-firming-moisturizer\/071249017609_t1.png"},{"Unnamed: 0":94,"brand":"L'Oreal Paris","category":"Skincare","name":"Men expert vita lift spf 15 anti wrinkle firming moisturizer","ingredients":"AQUA \/ WATER\nGLYCERINCYCLOHEXASILOXANE\nCAPRYLIC\/CAPRIC TRIGLYCERIDE\nDIMETHICONEALUMINUM STARCHOCTENYLSUCCINATE\nCYCLOPENTASILOXANEPEG-100 STEARATEGLYCERYL STEARATE\nBUTYROSPERMUM PARKII BUTTER \/ SHEA BUTTERMENTHA PIPERITA EXTRACT \/ PEPPERMINT LEAF EXTRACTC12-13 PARETH-23\nC12-13 PARETH-3STEARIC ACID\nTRIETHANOLAMINEDIMETHICONOL\nLITHIUM MAGNESIUM SODIUMSILICATESODIUM CITRATE\nSILICADIVINYLDIMETHICONE\/DIMETHICONECOPOLYMERPALMITIC ACID\nASCORBYL GLUCOSIDEAMMONIUM POLYACRYLDIMETHYLTAURAMIDE \/ AMMONIUMPOLYACRYLOYLDIMETHYL TAURATE\nXANTHAN GUM\nPISUM SATIVUM EXTRACT \/ PEA EXTRACTACRYLATES COPOLYMER\nCETYL ALCOHOLBUTYLENE GLYCOL\nRETINYL PALMITATEIMIDAZOLIDINYL UREAMETHYLPARABEN\nPHENOXYETHANOLBUTYLPARABEN\nLINALOOLLIMONENEPARFUM \/ FRAGRANCEPOTASSIUM SORBATE\nCHLORPHENESIN\n","details":"Men Expert Vita Lift SPF 15 Anti-Wrinkle & Firming Moisturizer is formulated specifically for wrinkles, sagging skin, and loss of firmness. Fortified Pro-Retinol A, a form of Vitamin A, helps reduce wrinkles and sagging skin while firming up the face and neck. Active Defense System (ADS) , our patented system that protects your skin against irritation, so you’re less likely to get redness, burning, or tightness. SPF 15 protects your skin against damaging UVA (aging) and UVB (burning) rays.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/men-expert-vita-lift-spf-15-anti-wrinkle-firming-moisturizer\/vita-lift-spf-15-anti-wrinkle-firming-moisturizer\/071249098721_t1.png"}]