[{"Unnamed: 0":1,"brand":"L'Oreal Paris","category":"Shampoo","name":"Sulfate free bond strengthening color care shampoo","ingredients":"Add this repairing shampoo to your hair care routine if you have:\n\n • Bleached hair\n • Heat damaged hair\n • Chemically damaged hair\n • Color-treated hair\n • Split ends\n • Breakage\n • Weak hair\n","details":"Bond repair shampoo for damaged hair, strengthens weak hair.\n\nRepairs hair in just one use with system. Suitable for color-treated hair.\n\nWhen hair is colored, bleached and damaged it can become weak from within. EverPure Bond Repair system with citric acid penetrates inside the hair cortex to rebuild weak hair bonds.\n\nFor smoother hair than with the number one prestige routine.\n\nFormulated without sulfates, parabens, DMDM hydantoin, added phthalates, dye, gluten ingredients.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/hair-care\/shampoo\/everpure-sulfate-free-bond-strengthening-color-care-shampoo\/new-07-26-2023\/071249406915_t1-new-min.png"},{"Unnamed: 0":2,"brand":"L'Oreal Paris","category":"Shampoo","name":"Everpure silver care shampoo","ingredients":"Wet hair, squeeze a quarter-sized amount of shampoo (add more for long or thick hair) into your palm, and massage into a lather on the scalp and through the lengths of hair. Leave it on for two minutes, rinse and follow up with EverPure Sulfate-Free Silver Care Conditioner with Peptides.","details":"Reinvigorate your silver and gray strands at home with EverPure Silver Care Shampoo. It’s enriched with skin care inspired ingredients, including strengthening peptides, to leave hair noticeably smoother with added bounce and volume. The nourishing formula:\n\nGently purifies the hair and scalp without stripping its natural oils\nHelps hair appear brighter, silkier and healthier\nLeaves hair feeling strong and nourished without weigh down\nIs free of DMDM hydantoin, added phthalates, gluten\nSulfate-free and paraben-free\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/hair-care\/shampoo\/everpure-silver-care-shampoo\/071249676967-t1.png"},{"Unnamed: 0":6,"brand":"L'Oreal Paris","category":"Shampoo","name":"Everpure clarify care shampoo","ingredients":"Apply a quarter-sized amount of EverPure Sulfate-Free Clarifying Shampoo with Antioxidants to the scalp and massage gently into a lather through wet hair, then rinse. Follow up with EverPure Sulfate-Free Restoring Conditioner with Antioxidants.","details":"Bring premium-quality hair care to your bathroom with EverPure Clarifying Shampoo. Just one wash can detox your strands to reveal bright, vibrant color. The enriching formula:\n\nFormulated for hard water exposure and product build-up\nRemoves residue and harsh salts without stripping color\nFormulated with Antioxidants, vitamin C and Glycine\nRemoves build up and reveal visibly healthy color\nCleanses hair and locks in hydration\nIs free of DMDM hydantoin and added phthalates\nSulfate-free, paraben-free, dye free\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/hair-care\/shampoo\/everpure-clarify-restore-shampoo\/071249680629-t1.png"},{"Unnamed: 0":8481,"brand":"Urban Decay","category":"Lipstick","name":"Vice Lipstick","ingredients":" Octyldodecanol- Isodecyl Neopentanoate- Kaolin- Cetyl Ricinoleate- Butyrospermum Parkii Oil \/ Shea Oil- Aluminum Starch Octenylsuccinate- Candelilla Cera \/ Candelilla Wax- Cetyl Lactate- Cera Alba \/ Beeswax- Cera Microcristallina \/ Microcrystalline Wax- Polyethylene- Dimethicone\/Bis-Isobutyl Ppg-20 Crosspolymer- Aqua \/ Water- Octyldodecyl Neopentanoate- Caprylyl Glycol- Calcium Sodium Borosilicate- Aluminum Hydroxide- Alumina- Pentaerythrityl Tetra-di-t-Butyl Hydroxyhydrocinnamate- Silica- Tocopherol- Tocopheryl Acetate- Colophonium \/ Rosin- Glycine Soja Oil \/ Soybean Oil- Squalane- Orbignya Oleifera Seed Oil- Simmondsia Chinensis Seed Oil \/ Jojoba Seed Oil- Ascorbyl Palmitate- Theobroma Cacao Seed Butter \/ Cocoa Seed Butter- Persea Gratissima Oil \/ Avocado Oil- Shorea Stenoptera Seed Butter- Butyrospermum Parkii Butter \/ Shea Butter- Tin Oxide- Aloe Barbadensis Leaf Extract- Synthetic Fluorphlogopite- Calcium Aluminum Borosilicate- Polyethylene Terephthalate- Citric Acid- Polylactic Acid. [+\/- (May Contain\/Peut contenir): CI 77891 \/ Titanium Dioxide- CI 77491- CI 77492- CI 77499 \/ Iron Oxides- Mica- CI 15850 \/ Red 7 Lake- CI 77120 \/ Barium Sulfate- CI 45410 \/ Red 28 Lake- CI 15850 \/ Red 6- CI 19140 \/ Yellow 5 Lake- CI 15985 \/ Yellow 6 Lake- CI 42090 \/ Blue 1 Lake- CI 17200 \/ Red 33 Lake- CI 75470 \/ Carmine].","details":"What it is: An innovative lip formula- in an array of shades and finishes- that gives an unbelievable laydown of color with just one swipe.What it does: Vice Lipstick features six indulgent finishes  and array of addictive shades that range from bold brights to dark hues to versatile neutrals. Each shade applies smoothly (without dragging or skipping)- hugs lips- and feels ultra-comfortable. Urban Decay’s proprietary Pigment Infusion System™ gives the formula its super-creamy texture- rich payout- and superior color dispersion. What else you need to know: This creamy formula is packed with nourishing ingredients. A butter blend comforts- hydrates- and enhances- leaving lips soft and conditioned- and never dry. Aloe vera- jojoba- avocado- and babassu oils nourish and soften lips. Illipe butter- derived from Malaysian illipe trees- provides long-lasting moisture- while the vitamins C and E deliver a hint of antioxidants.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2481943-main-zoom.jpg?imwidth=930"}]