[{"Unnamed: 0":4807,"brand":"Lancôme","category":"Moisturizers","name":"UV Expert Aquagel Defense Primer & Moisturizer SPF 50","ingredients":" -Vitamin E: A potent antioxidant that helps improve skin. -Moringa Extract: A potent antioxidant that helps improve skin. -Edelweiss Extract: A potent antioxidant that helps improve skin.  Avobenzone 3%- Homosalate 10.7%- Octisalate 3.2%- Octocrylene 6%- Oxybenzone 3.9%.- Water- Dimethicone- Alcohol Denat.- Styrene\/Acrylates Copolymer- Acrylates\/Dimethicone Copolyme- Tocophero- Sodium Polyacrylate- Sodium Dodecylbenzenesulfonate- Sodium Benzoate- Phenoxyethanol- Peg-8 Laurate- Silica- Pentylene Glycol- Mentha Piperita (Peppermint) Extract- Propylene Glycol- Leontopodium Alpinum Flower\/Leaf Extract- Caprylyl Glycol- Acrylates\/C10-30 Alkyl Acrylate Crosspolyme- Sorbitol- Moringa Oleifera Seed Extract- Disodium Edta- Rosa Gallica Flower Extract- Disodium Phosphate- Citric Acid- Potassium Sorbate- Glycerin- Fragrance.","details":"What it is:  A primer- moisturizer- and sunscreen that hydrates- primes- and protects skin.Skin Type: Normal- Dry- Combination- and Oily Skincare Concerns: DrynessFormulation: GelHighlighted Ingredients:- Vitamin E: A potent antioxidant that helps improve skin. - Moringa Extract: A potent antioxidant that helps improve skin. - Edelweiss Extract: A potent antioxidant that helps improve skin.  Ingredient Callouts: Free of sulfates SLS and SLES- formaldehydes- formaldehyde-releasing agents- phthalates- mineral oil- retinyl palmitate- coal tar- hydroquinone- triclosan- and triclocarban- and contains less than one percent of synthetic fragrances.  What Else You Need to Know:  Sun damage is known to cause first signs of aging. This all-in-one moisturizer with SPF 50 UVA\/UVB protection gives lasting hydration and helps protect skin against sun damage. The cooling Aquagel texture transforms into a water-like gel that's easy to blend and is translucent on skin. This formula is not heavy- greasy or sticky- and it won't clog pores. It’s suitable for all skin types- including sensitive skin. ","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2186773-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":27,"brand":"L'Oreal Paris","category":"Skincare","name":"Bright reveal spf 50 invisible uv fluid","ingredients":"Bright Reveal SPF 50 Daily UV Lotion is suitable for all skin types, including sensitive skin, mature skin and combination skin.\n","details":"Bright Reveal SPF 50 Daily UV Lotion is your key to glowy and protected skin. Formulated with UVA and UVB filters to provide broad spectrum protection from sun rays that cause aging and burning, it includes vitamin C and vitamin E to also help protect against environmental damage caused by free radicals that can accelerate the appearance of aging signs. Skin immediately feels fresh and moisturized and over time skin looks brighter, tone looks more even and fine lines are visibly reduced. Additional results and benefits include:\n\nInvisible, lightweight, non-greasy texture\n96% of participants said product does not leave a white cast* (*in a consumer study of 86 women)\nBlends well with all skin tones\nSuitable for all skin types, including sensitive skin and mature skin\nPrimes well for makeup\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-derm-intensives-broad-spectrum-spf-50-invisible-uv-fluid\/071249683491-t1.png"}]