[{"Unnamed: 0":4818,"brand":"Lancôme","category":"Eye Creams & Treatments","name":"Advanced Génifique Yeux Light-Pearl™ Eye Illuminator Youth Activating Concentrate","ingredients":"-Bifidus Prebiotic 10%: Strengthens and protects skin's moisture barrier. -Caffeine-Vitamin EWater- Bifida Ferment Lysate- Propanediol- Glycerin- Alcohol Denat.- Dimethicone- C13-14 Isoparaffin- Escin- Tocopheryl Acetate- Sodium Benzoate- Phenoxyethanol- Adenosine- Caffeine- Polyacrylamide- Chlorphenesin- Polymethylsilsesquioxane- Chlorella Vulgaris Extract- Salicyloyl Phytosphingosine- Dimethicone\/Vinyl Dimethicone Crosspolymer- Ammonium Polyacryldimethyltauramide \/ Ammonium Polyacryloyldimethyl Taurate- Dimethiconol- Pentaerythrityl Tetraethylhexanoate- Xanthan Gum- Caprylic\/Capric Triglyceride- Bis-Peg\/Ppg-16\/16 Peg\/Ppg-16\/16 Dimethicone- Bht- Laureth-7.","details":"What it is:  An oil-free- eye-illuminating and eyelash serum with a flexible- cooling massaging applicator for smoother- more luminous- younger-looking eyes.Skin Type: Normal- Dry- Combination- and Oily Skincare Concerns: Fine Lines and Wrinkles- Dark Circles and Puffiness- and DrynessFormulation: Lightweight LiquidHighlighted Ingredients:- Bifidus Prebiotic 10%: Strengthens and protects skin's moisture barrier. - Caffeine- Vitamin EIngredient Callouts: Free of sulfates SLS and SLES- parabens- and phthalates. What Else You Need to Know: Engineered with a cooling and flexible massaging applicator- this youth-activating eye and eyelash formulation reduces the appearance of under-eye wrinkles- under-eye bags- and eye puffiness. It also improves the appearance of dark circles- increases eye hydration- and fortifies eyelashes for increased vitality and density. This product is safe for sensitive eyes- it has been allergy tested under ophthalmological and dermatological control- and is safe to use on lash extensions.Clinical Results: Based on a consumer self-assessment study on 50 women in a 4-week study: - Lashes look supple- silky- and protected from breakage- 94% of women agree eye contour skin feels hydrated- 92% of women agree eye contour skin looks softer","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1710276-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":8512,"brand":"Urban Decay","category":"Face Primer","name":"Quick Fix Hydracharged Complexion Prep Priming Spray","ingredients":"Water- Hamamelis Witch Hazel Water- Niacinamide- Propanediol- Coconut Water- Glycereth-5 Lactate- PEG-35 Castor Oil- Phenoxyethanol- Caffeine- Dimethicone PEG-7 Phosphate- Caprylic\/Capric Triglyceride- Glycolic Acid- Bisabolol- Fragrance- Carnitine- Ethylhexylglycerin- Zinc Gluconate- Magnesium Aspartate- Radish Root- Ferment Filtrate- Benzyl Benzoate- Coumarin- Copper Gluconate- Benzyl Alcohol.","details":"What it is:\n A hydrating- soothing priming spray that visibly reduces the appearance of pores- brightens and smooths skin- and hydrates.\n\nWhat it does:\n Reduce the look of a late night out with this priming spray. Once you cleanse your post-party complexion- balance and reinvigorate your skin with Urban Decay’s Quick Fix Hydra-Charged Complexion Prep Priming Spray. The soothing- prep-priming spray is light enough to use throughout the day—without messing up your makeup- and it also hydrates and softens skin. Use it in the morning to prep and reawaken your skin before applying makeup. Use it at night before your treatment- or anytime you need a quick boost. \n\n\nCreated in an exclusive partnership with Skindinavia and inspired by the Korean water trend- this spray is even more hydrating than B6 Prep Spray. This energizing formula is versatile enough for every skin type- and it’s loaded with skin-nourishing ingredients like vitamin B3- Sepitonic™ M3- and coconut water. Treat your skin to intense moisture as you prep- prime- and balance your complexion.\n\nWhat else you need to know:\n Quick Fix comes in a sleek- soft-touch neon green bottle with a frosted white cap. Like other Urban Decay sprays- the sprayer emits a calibrated- micro-fine mist that goes on so light- you’ll hardly feel it—and it and smells like a summer day on the beach.\n\nResearch results:\n In a clinical study on 30 people- immediately after use:\n- 100% of participants had a reduction in pore visibility\n- 100% had a visible improvement in skin radiance\n- 83% had a visible improvement in skin hydration","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s1899962-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":8527,"brand":"Urban Decay","category":"Makeup","name":"Quick Fix Hydracharged Complexion Prep Priming Spray Mini","ingredients":"Water- Hamamelis Witch Hazel Water- Niacinamide- Propanediol- Coconut Water- Glycereth-5 Lactate- PEG-35 Castor Oil- Phenoxyethanol- Caffeine- Dimethicone PEG-7 Phosphate- Caprylic\/Capric Triglyceride- Glycolic Acid- Bisabolol- Fragrance- Carnitine- Ethylhexylglycerin- Zinc Gluconate- Magnesium Aspartate- Radish Root- Ferment Filtrate- Benzyl Benzoate- Coumarin- Copper Gluconate- Benzyl Alcohol.","details":"What it is:\n A hydrating- soothing priming spray that visibly reduces the appearance of pores- brightens and smooths skin- and hydrates.\n\nWhat it does:\n Reduce the look of a late night out with this priming spray. Once you cleanse your post-party complexion- balance and reinvigorate your skin with Urban Decay’s Quick Fix Hydra-Charged Complexion Prep Priming Spray. The soothing- prep-priming spray is light enough to use throughout the day—without messing up your makeup- and it also hydrates and softens skin. Use it in the morning to prep and reawaken your skin before applying makeup. Use it at night before your treatment- or anytime you need a quick boost. \n\n\nCreated in an exclusive partnership with Skindinavia and inspired by the Korean water trend- this spray is even more hydrating than B6 Prep Spray. This energizing formula is versatile enough for every skin type- and it’s loaded with skin-nourishing ingredients like vitamin B3- Sepitonic™ M3- and coconut water. Treat your skin to intense moisture as you prep- prime- and balance your complexion.\n\nWhat else you need to know:\n Quick Fix comes in a sleek- soft-touch neon green bottle with a frosted white cap. Like other Urban Decay sprays- the sprayer emits a calibrated- micro-fine mist that goes on so light- you’ll hardly feel it—and it and smells like a summer day on the beach.\n\nResearch results:\n In a clinical study on 30 people- immediately after use:\n- 100% of participants had a reduction in pore visibility\n- 100% had a visible improvement in skin radiance\n- 83% had a visible improvement in skin hydration","image_url":"https:\/\/www.ace.co.uk\/images\/imgzoom\/77\/77167401_xxl_a1.jpg"},{"Unnamed: 0":8853,"brand":"Youth To The People","category":"Moisturizers","name":"Adaptogen Deep Moisture Cream with Ashwagandha + Reishi","ingredients":" -Squalane: Mimics your skin’s natural oils to boost skin hydration while minimizing the risk of clogged pores.-Ashwagandha: Helps reduce visible signs of fatigue.-Fermented Reishi: Works to hydrate- detoxify- and combat premature signs of aging.  Water\/Aqua\/Eau (Aqua)- Helianthus Annuus (Sunflower) Oil- Octyl Palmitate- Glyceryl Stearate- Propanediol- Stearic Acid- Rhodiola Rosea Extract- Ocimum Tenuiflorum (Holy Basil) Extract- Withania Somnifera (Ashwagandha) Extract- Ganoderma Lucidum (Reishi Mushroom) Extract- Aloe Barbadensis Leaf Juice- Glyceryl Laurate- Squalane (Olive)- Phenoxyethanol- Simmondsia Chinensis (Jojoba) Seed Oil- Pentapeptide-59- Hydrogenated Lecithin- Butyrospermum Parkii (Shea) Butter- Phenethyl Alcohol- Ethylhexylglycerin- Maltodextrin- Carbomer- Mixed Tocopherols- Ethylhexylglycerin- Allantoin- Panthenol- Prunus Amygdalus Dulcis (Sweet Almond) Oil- Borago Officinalis (Borage) Oil- Caramel Color- Xanthan Gum. Clean at Sephora products are formulated without:Sulfates—SLS + SLES- Parabens- Formaldehydes- Formaldehyde-releasing agents- Phthalates- Mineral Oil- Retinyl Palmitate- Oxybenzone- Coal Tar- Hydroquinone- Triclosan- Triclocarban- Undisclosed synthetic fragrances (Products can be formulated with disclosed synthetic fragrances that meet the following two criteria: (1) the synthetic fragrances do not include any of the ingredients listed in numbers 1 through 12 above and (2) the synthetic fragrances are at a concentration below 1% of the total formula) The following type of acrylates: (ethyl acrylate- ethyl methacrylate- methyl methacrylate- butyl methacrylate- hydroxypropyl methacrylate- tetrahydrofurfuryl methacrylate- trimethylolpropane trimethacrylate - aluminum salts)- Animal Oils\/Musks\/Fats- Benzophenone + Related Compounds- Butoxyethanol- Carbon Black- Lead\/Lead Acetate- Methyl Cellosolve + Methoxyethanol- Methylchloroisothiazolinone & Methylisothiazolinone- Mercury + Mercury Compounds (Thimerisol)- Insoluble Plastic Microbeads (This prohibited ingredient applies to products that are meant to be rinsed off )- Resorcinol- Talc (Talc that is free of any asbestos can be used in the formulation provided that Brand conducts testing to ensure that talc is free of any asbestos.)- Toluene- Butylated hydroxyanisole (BHA)- Butylated hydroxytoluene (BHT) that is 0.1% or more of total formula- Ethanolamines DEA\/TEA\/MEA\/ETA- Nanoparticles as defined by the European Commission- Petrolatum and Parrafin that is not USP grade- Phenoxyethanol that is 1% or more of total formulation- Polyacrylamide & Acrylamide- The following types of Styrene (Bromostyrene- Deastyrene\/acrylates\/dvbcopolymer- sodium styrene\/divinylbenzene copolymer - styrene oxide- styrene)- 1-4 Dioxane in final formulas must comply with the thresholds as follows: (10 or < ppm for products that are meant to be rinsed off- wiped off or removed- 3ppm or < for products that are meant to remain on the skin).","details":"What it is:  A hydrating moisturizer with superior plant extracts and a pro-grade peptide complex formulated for dry- reactive- and sensitive skin.Skin Type: Dry- Sensitive- and Normal  Skincare Concerns: Dryness- Fine Lines and Wrinkles- and RednessFormulation: Rich Cream Highlighted Ingredients:- Squalane: Mimics your skin’s natural oils to boost skin hydration while minimizing the risk of clogged pores.- Ashwagandha: Helps reduce visible signs of fatigue.- Fermented Reishi: Works to hydrate- detoxify- and combat premature signs of aging.  Ingredient Callouts: This product is vegan- cruelty-free- and comes in recyclable packaging. What Else You Need to Know:  This fragrance-free formula is made with Youth To The People’s intelligent hydration trio of squalane- jojoba- and shea butter for long-lasting hydration that won’t clog pores. Their adaptogen blend and calming peptides help skin cope with daily dryness- visible redness- and fine lines and wrinkles.Clean at SephoraClean at Sephora is formulated without a list of over 50 ingredients- including sulfates (SLS and SLES)- parabens- phthalates- and more. For the full list- check out the Ingredients tab.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2088029-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":8863,"brand":"Youth To The People","category":"Mists & Essences","name":"Adaptogen Soothe + Hydrate Activated Mist with Reishi + Ashwagandha","ingredients":" -Reishi: Helps to address visible redness and combat dehydration. \n-Pentapeptide: Calms sensitive and reactive skin with continued use. \n-Ashwagandha: A powerful healing herb full of antioxidants- iron- and amino acids to address stress and exhaustion.\n-Hyaluronic Acid: Helps skin absorb and retain moisture.\n\n Water- Propanediol- Aloe Barbadensis Leaf Juice- Pentapeptide-59- Hydrogenated Lecithin- Butyrospermum Parkii (Shea) Butter- Phenethyl Alcohol- Ethylhexylglycerin- Maltodextrin- Ganoderma Lucidum (Reishi Mushroom) Extract- Xanthan Gum- Betaine- 1-2-Hexanediol- Caprylyl Glycol- Potassium Sorbate- Glycerin- Withania Somnifera (Ashwagandha) Extract- Ocimum Tenuiflorum (Holy Basil) Extract- Rhodiola Rosea Extract- Lactic Acid- Sodium Hyaluronate.\nClean at Sephora products are formulated without:\nSulfates—SLS + SLES- Parabens- Formaldehydes- Formaldehyde-releasing agents- Phthalates- Mineral Oil- Retinyl Palmitate- Oxybenzone- Coal Tar- Hydroquinone- Triclosan- Triclocarban- Undisclosed synthetic fragrances (Products can be formulated with disclosed synthetic fragrances that meet the following two criteria: (1) the synthetic fragrances do not include any of the ingredients listed in numbers 1 through 12 above and (2) the synthetic fragrances are at a concentration below 1% of the total formula) The following type of acrylates: (ethyl acrylate- ethyl methacrylate- methyl methacrylate- butyl methacrylate- hydroxypropyl methacrylate- tetrahydrofurfuryl methacrylate- trimethylolpropane trimethacrylate - aluminum salts)- Animal Oils\/Musks\/Fats - Benzophenone + Related Compounds- Butoxyethanol- Carbon Black- Lead\/Lead Acetate- Methyl Cellosolve + Methoxyethanol- Methylchloroisothiazolinone & Methylisothiazolinone- Mercury + Mercury Compounds (Thimerisol)- Insoluble Plastic Microbeads (This prohibited ingredient applies to products that are meant to be rinsed off )- Resorcinol- Talc (Talc that is free of any asbestos can be used in the formulation provided that Brand conducts testing to ensure that talc is free of any asbestos.)- Toluene- Butylated hydroxyanisole (BHA)- Butylated hydroxytoluene (BHT) that is 0.1% or more of total formula- Ethanolamines DEA\/TEA\/MEA\/ETA- Nanoparticles As defined by the European Commission- Petrolatum and Parrafin that is not USP grade- Phenoxyethanol that is 1% or more of total formulation- Polyacrylamide & Acrylamide- The following types of Styrene (Bromostyrene- Deastyrene\/acrylates\/dvbcopolymer- sodium styrene\/divinylbenzene copolymer - styrene oxide- styrene)- 1-4 Dioxane in final formulas must comply with the thresholds as follows: (10 or < ppm for products that are meant to be rinsed off- wiped off or removed- 3ppm or < for products that are meant to remain on the skin).","details":"What it is:  \nAn ultra-fine mist that hydrates- calms visible redness- and evens the look of skin tone with antioxidant-rich adaptogens- hyaluronic acid- and soothing peptides—like a serum in a mist.\n\nSkin Type: Dry \n\nSkincare Concerns: Redness and Dryness\n\nFormulation: Spray\n\nHighlighted Ingredients:\n- Reishi: Helps to address visible redness and combat dehydration. \n- Pentapeptide: Calms sensitive and reactive skin with continued use. \n- Ashwagandha: A powerful healing herb full of antioxidants- iron- and amino acids to address stress and exhaustion.\n- Hyaluronic Acid: Helps skin absorb and retain moisture.\n\n Ingredient Callouts: This product is vegan- cruelty-free- and gluten-free- and comes in recyclable packaging. \n\nWhat Else You Need to Know:  Youth To The People’s potent peptide is protected in shea butter until it activates through the mister and melts into skin to soothe- hydrate- and lock in moisture. Antioxidant-rich reishi helps balance hydration and recover from stress. It's formulated without binders- giving it a gorgeous natural milky color.\nClean at SephoraClean at Sephora is formulated without a list of over 50 ingredients- including sulfates (SLS and SLES)- parabens- phthalates- and more. For the full list- check out the Ingredients tab.","image_url":"https:\/\/www.sephora.com\/productimages\/sku\/s2233997-main-zoom.jpg?imwidth=930"},{"Unnamed: 0":21,"brand":"L'Oreal Paris","category":"Skincare","name":"Age perfect hydra nutrition manuka honey day cream","ingredients":"782853\/4\nAQUA \/ WATER\nGLYCERIN\nPARAFFINUM LIQUIDUM \/ MINERAL OIL\nISOCETYL STEARATE\nHYDROGENATED POLYISOBUTENE\nDIMETHICONE\nBUTYROSPERMUM PARKII BUTTER \/ SHEA BUTTER\nCERA ALBA \/ BEESWAX\nCETYL ALCOHOL\nGLYCERYL STEARATE\nPEG-100 STEARATE\nMEL \/ HONEY\nCAMELINA SATIVA SEED OIL\nHYDROXYETHYLPIPERAZINE ETHANE SULFONIC ACID\nROSA CANINA FRUIT OIL\nORIGANUM MAJORANA LEAF OIL\nANTHEMIS NOBILIS FLOWER OIL\nPRUNUS ARMENIACA KERNEL OIL \/ APRICOT KERNEL OIL\nCITRUS AURANTIUM AMARA FLOWER OIL \/ BITTER ORANGE FLOWER OIL\nCITRUS AURANTIUM DULCIS PEEL OIL \/ ORANGE PEEL OIL\nZEA MAYS OIL \/ CORN OIL\nMEL EXTRACT \/ HONEY EXTRACT\nCERA MICROCRISTALLINA \/ MICROCRYSTALLINE WAX\nPARAFFIN\nROYAL JELLY EXTRACT\nISOBUTANE\nSORBITAN OLEATE\nSORBITAN TRISTEARATE\nCALCIUM PANTETHEINE SULFONATE\nCOPERNICIA CERIFERA CERA \/ CARNAUBA WAX\nISOHEXADECANE\nSODIUM HYDROXIDE\nASCORBYL GLUCOSIDE\nDISODIUM EDTA\nPROPYLENE GLYCOL\nCAPRYLYL GLYCOL\nCITRIC ACID\nPASSIFLORA EDULIS SEED OIL\nXANTHAN GUM\nPOLYSORBATE 80\nACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER\nACRYLONITRILE\/METHYL METHACRYLATE\/VINYLIDENE CHLORIDE COPOLYMER\nORYZA SATIVA BRAN OIL \/ RICE BRAN OIL\nTOCOPHEROL\nASCORBYL PALMITATE\nPROPYL GALLATE\nPENTAERYTHRITYL TETRA-DI-T-BUTYL HYDROXYHYDROCINNAMATE\nCI 15985 \/ YELLOW 6\nCI 19140 \/ YELLOW 5\nLINALOOL\nGERANIOL\nEUGENOL\nCOUMARIN\nLIMONENE\nCITRAL\nCITRONELLOL\nBENZYL ALCOHOL\nPARFUM \/ FRAGRANCE","details":"Decadent, creamy face moisturizer with nurturing oils and Manuka Honey Extract is infused with calcium and antioxidants. Envelops the skin with a soft, silky layer of comfort to replenish skin with 24H of long lasting, non-greasy, non-sticky hydration. Rich cream penetrates effectively into the skin's surface layer to restore comfort and nourishing moisture to mature, very dry skin. Leaves skin firmer, feeling supple and elastic with a healthy glow. Paraben free, allergy tested, non-sticky, suitable for sensitive skin. Packaging May Vary. What you receive may not be what is reflected on site.\n\n• New look and improved formula to our Age Perfect Hydra-Nutrition Day Cream\n• Nourishing day cream face moisturizer with nurturing oils and Manuka Honey extract helps very dry skin  retain moisture for 24 hours \n• Immediately, skin feels nourished - in 4 weeks skin feels firmer more supple\n• Paraben free, allergy tested, non-sticky, suitable for sensitive skin\n\n*Money back guarantee, up to $24.99 (sales tax and shipping not refunded), for L’Oréal Paris Age Perfect. Purchase made between 3\/1\/2020-12\/31\/20 redeem by 1\/30\/21. Restrictions apply. For details, call 1-855-332-9983. ","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/age-perfect-hydra-nutrition-manuka-honey-day-cream\/hydra-nutrition-manuka-honey-day-cream\/071249383001_t1.png"},{"Unnamed: 0":23,"brand":"L'Oreal Paris","category":"Skincare","name":"Wrinkle expert 35 moisturizer","ingredients":"AQUA \/ WATER\nCYCLOHEXASILOXANE\nGLYCERIN\nBUTYROSPERMUM PARKII BUTTER \/ SHEA BUTTER\nISOHEXADECANE\nPENTAERYTHRITYL TETRAETHYLHEXANOATE\nDIPROPYLENE GLYCOL\nCERA ALBA \/ BEESWAX\nSTEARIC ACID\nDIMETHICONE\nPALMITIC ACID\nACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER\nPEG-100 STEARATE\nSTEARYL ALCOHOL\nGLYCERYL STEARATE\nPEG-20 STEARATE\nPHENOXYETHANOL\nMETHYLPARABEN\nPARFUM \/ FRAGRANCE\nPOLYSORBATE 80\nBOSWELIA SERRATA EXTRACT \/ BOSWELLIA SERRATA EXTRACT\nDIMETHICONOL\nMANGANESE GLUCONATE\nGLYCINE SOJA OIL \/ SOYBEAN OIL\nTOCOPHEROL\nPROPYLENE GLYCOL\nCAPRYLOYL SALICYLIC ACID\nDISODIUM EDTA\nMYRISTIC ACID\nSORBITAN OLEATE\nSODIUM HYDROXIDE\nSOLUBLE COLLAGEN\nTRISODIUM EDTA\nPOTASSIUM SORBATE\nCITRIC ACID\n\n","details":"Wrinkle Expert is L’Oréal Paris’ first daily anti-wrinkle skincare line for all of life’s stages featuring formulas, with selected ingredients, for younger looking skin at every age. Our moisturizing face cream for ages 35+ contains Collagen to help strengthen skin’s cushion, for smoother, plumper skin. Visibly reduces first signs of aging including fine lines, elasticity loss, and dryness.\nLimited Distribution – available in-store at HEB and Walmart, click “Find Nearby” to find a store near you.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/wrinkle-expert-35-moisturizer\/35-moisturizer\/t1_we-35-product-shot.png"},{"Unnamed: 0":27,"brand":"L'Oreal Paris","category":"Skincare","name":"Bright reveal spf 50 invisible uv fluid","ingredients":"Bright Reveal SPF 50 Daily UV Lotion is suitable for all skin types, including sensitive skin, mature skin and combination skin.\n","details":"Bright Reveal SPF 50 Daily UV Lotion is your key to glowy and protected skin. Formulated with UVA and UVB filters to provide broad spectrum protection from sun rays that cause aging and burning, it includes vitamin C and vitamin E to also help protect against environmental damage caused by free radicals that can accelerate the appearance of aging signs. Skin immediately feels fresh and moisturized and over time skin looks brighter, tone looks more even and fine lines are visibly reduced. Additional results and benefits include:\n\nInvisible, lightweight, non-greasy texture\n96% of participants said product does not leave a white cast* (*in a consumer study of 86 women)\nBlends well with all skin tones\nSuitable for all skin types, including sensitive skin and mature skin\nPrimes well for makeup\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-derm-intensives-broad-spectrum-spf-50-invisible-uv-fluid\/071249683491-t1.png"},{"Unnamed: 0":29,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift derm intensives pure hyaluronic acid serum","ingredients":"The short answer is everyone. Skin hydration is a necessity whether you’re 22 or 52. “Hyaluronic acid is like the popular kid at school who is friends with everyone,” explains Dr. Joshua Zeichner, board-certified dermatologist. “It can be combined with almost all other skin care ingredients since it helps to hydrate, plump, and protect the outer skin layer.”\n\nRead More on Beauty Magazine.\n \nYou should especially reach for this serum if you have:\n\nVery Dry skin\nSensitive Skin\nMature Skin\nWrinkles\nSagging\n","details":"Revitalift Derm Intensives 1.5% Pure Hyaluronic Acid Serum is our most potent hydrating formula with our highest concentration of pure hyaluronic acid. So effective, it immediately hydrates, plumps skin in 1 week, and reduces wrinkles.\n\nWhat Does Hyaluronic Acid Serum Do?\n\nHyaluronic Acid Serum is an anti-aging face serum for visibly bouncy and more youthful-looking skin. This lightweight hydrating serum absorbs quickly with no tacky feel or leftover residue and replenishes hydration with the following results:\n \n\nImmediately, it delivers intense moisture that leaves the skin with a fully hydrated and dewy glow.\nIn 1 week, skin is visibly plumped and feels firmer and more elastic. The youthful, bouncy feel returns and skin is visibly refreshed and glowing with moisture. \nOvertime, fine lines and wrinkles are visibly reduced.\n\nWhat Makes Our Hyaluronic Acid Formula Special?\nOur potent formula combines high and low-molecular weight pure hyaluronic acid for a dual replumping and hydrating effect. Here’s how it works:\n\n0.5% high molecular weight pure hyaluronic acid intensely re-hydrates the skin’s surface and stays on top of the skin to help lock in moisture for dewy-looking skin.\n1% low molecular weight pure hyaluronic acid absorbs more easily to help smooth skin texture and instantly plump skin.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-derm-intensives-pure-hyaluronic-acid-serum\/lorealparisusa-derm-intensive-hyaluronic-acid-pdp.png"},{"Unnamed: 0":31,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift derm intensives night serum 03 pure retinol","ingredients":"Revitalift Night Serum, 0.3% Pure Retinol is suitable for all skin types, including","details":"The Revitalift Night Serum, 0.3% Pure Retinol is formulated with soothing ingredients like glycerin and hyaluronic acid to help balance the potential drying effects of retinol. The allergy tested serum is suitable for all skin types and boasts a number of effective results:\n\nImmediately skin feels moisturized\nSkin texture feels smoother and more refined \nComplexion is brighter, luminous, and glowing\nOvertime, wrinkles are visibly reduced, even forehead wrinkles\n\n\nWhat Is Pure Retinol?\nWhile there are many retinols available in the market — complexes, derivatives and pure — dermatologists recommend pure retinol because it is the most researched and effective anti-aging ingredient. Pure Retinol is an optimal concentration that has been dermatologist-validated for fast, visible results.\n\nThough most effective, it is unstable when exposed to air and light, causing it to be less effective overtime. L’Oreal Paris’s exclusive technology, Retinol Guard™, helps to protect the formula so it is potent and effective from the first drop to the last.\n\n*Results based on a 12-week clinical study of women aged 35-75 when used as directed.\n*An external panel of dermatologists validated that Revitalift Derm Intensives serums uphold strict formulation standards and reviewed independent clinical testing results and protocols.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/face-serums\/revitalift-derm-intensives-night-serum-03-pure-retinol\/revitalift-derm-intensives-night-serum-03-pure-retinol\/lorealparisusa-derm-intensive-pure-retinol-pdp.png"},{"Unnamed: 0":32,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift triple power anti aging moisturizer","ingredients":"Revitalift Triple Power Anti-Aging Moisturizer is dermatologist-tested for safety and suitable for all skin types, including sensitive skin. It’s also available in a fragrance-free formula and broad-spectrum SPF 30 sunscreen.","details":"Revitalift Triple Power Anti-Aging Moisturizer instantly helps skin feel softer, smoother and hydrated for 24 hours. It’s formulated with hyaluronic acid, vitamin C, and Pro-Retinol to visibly reduce wrinkles, improve firmness and brighten skin tone in just one week. \n\nWhy Choose Triple Power?\nThe non-greasy formula absorbs quickly. Suitable for all skin types, it can be paired with 1.5% Pure Hyaluronic Acid Serum for an added boost of hydration and radiance, and visibly reduced wrinkles for younger-looking skin. It delivers noticeable results with the help of these three top dermatologist-recommended ingredients:\n\nHyaluronic Acid: A potent hydration-attracting molecule naturally found in skin to enhance and retain moisture levels.\nVitamin C: A vital antioxidant naturally found in skin, known to boost radiance, even tone and neutralize free radicals that can lead to signs of aging.\nPro-Retinol: A gentle, stabilized derivative of retinol that works with other ingredients in the formula to visibly reduce wrinkles and firm skin.\n\nPro Tip: Revitalift Triple Power Anti-Aging Moisturizer is specially formulated to layer well under makeup without clogging pores. Smooth this cream until thoroughly absorbed to use as a primer and create the perfect moisturized base before makeup.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-triple-power-anti-aging-moisturizer\/triple-power-anti-aging-moisturizer\/071249227916_t1.png"},{"Unnamed: 0":33,"brand":"L'Oreal Paris","category":"Skincare","name":"Derm intensives hyaluronic acid plus eye serum","ingredients":"Reach for this powerhouse eye serum when you have:\nPesky under-eye wrinkles\nUnwanted crow’s feet\nDry skin in the eye area\nDark circles","details":"1.5% Hyaluronic Acid + 1% Caffeine Eye Serum visibly replumps, brightens and reduces crow's feet in the eye area. The non-greasy formula includes hyaluronic acid to enhance skin's moisture retention and caffeine, which is known to re-energize skin to help reduce the appearance of dark circles and puffiness.\nValidated in partnership with an advisory panel of dermatologists, the serum even layers well under makeup. Instantly, skin feels moisturized and eyes look less tired. Over time:\n\nFine lines and crow's feet are visibly smoother\nDark circles look noticeably brighter\nEyes look younger\nSkin feels firmer\n\n\nWhat's Unique About The Applicator?\nOur triple roller applicator includes three cooling, stainless steel balls that bend, providing a full eye contour massage to leave eyes looking refreshed, well-rested and noticeably depuffed.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/hyaluronic-acid-serum\/derm-intensives-hyaluronic-acid-plus-eye-serum\/revitalift-eye-serum\/revitalift-with-seal.png"},{"Unnamed: 0":35,"brand":"L'Oreal Paris","category":"Skincare","name":"Derm intensives 5 percent glycolic acid toner","ingredients":"Aqua \/ Water \/ Eau, Glycolic Acid, Hydroxyethylpiperazine Ethane Sulfonic Acid, Glycerin, Sodium Hydroxide, Citric Acid, Pentylene Glycol, Aloe Barbadensis Leaf Juice, Citrullus Lanatus Fruit Extract \/ Watermelon Fruit Extract, Allantoin, Ascorbyl Glucoside, Panthenol, Tocopherol, Bis-Peg-18 Methyl Ether Dimethyl Silane, Potassium Sorbate, Salicylic Acid, Sodium Benzoate Fil #B274432\/1\n","details":"The secret to smooth and glowing skin? Gentle exfoliation in 1 simple step! NEW Revitalift Derm Intensives 5% Pure Glycolic Acid Toner, a daily peeling toner that smooths skin texture and reveals glowing, smoother, brighter skin\n\nHow It Works- Formulated with 5 Percent Pure Glycolic Acid to increase cell turnover, Infused with Aloe Vera to soothe and moisturize the skin for gentle and effective daily exfoliation\nWhat's New- Dermatologist- Validated formula with 5 percent Pure Glycolic Acid and Aloe Vera, Effective concentration designed for daily use, Suitable for all skin types, even sensitive, Effective for all skin tones\nVisible Results- Immediately skin feels smoother, refreshed and clean- In 1 week, skin feels softer and looks renewed with a healthy glow, Overtime, appearance of dark spots is reduced\n\nFragrance free, Paraben and Alcohol free, Allergy Tested, Mineral Oil and Dye Free, Pair with your Revitalift Derm Intensives Serum and Revitalift Triple Power SPF 30 Moisturizer in the AM to protect skin from sun exposure.\n\n*An external panel of dermatologists validated that Revitalift Derm Intensives products uphold strict formulation standards and reviewed independent clinical testing results and protocols.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/glycolic-serum\/derm-intensives-5-percent-glycolic-acid-toner\/lorealskincarerevitaliftdermintensives5glycolicacidtonerfront-4.png"},{"Unnamed: 0":37,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift derm intensives 10 pure glycolic acid serum","ingredients":"AQUA \/ WATER \/ EAU\nGLYCOLIC ACID\nGLYCERIN\nALCOHOL DENAT.\nSODIUM HYDROXIDE\nALOE BARBADENSIS LEAF JUICE\nSODIUM HYALURONATE\nHYDROXYETHYLCELLULOSE\nASCORBYL GLUCOSIDE\nCITRIC ACID\nPOTASSIUM SORBATE\nSODIUM BENZOATE\n\nFIL CODE  D235027\/1","details":"Validated in partnership with an external panel of dermatologists, 10% Pure Glycolic Acid Serum absorbs quickly to visibly even skin tone and reduce wrinkles, fine lines & dark spots.\n\nGlycolic Acid is an alpha hydroxy acid (AHA) recognized by dermatologists as an effective resurfacing agent for even and younger-looking skin. This daily use face serum is specially blended with Aloe - a plant-derived\/botanical extract, renowned for its soothing benefits. Immediately, after applying face serum skin feels smoother and visibly refined. After 1 week of using serum, skin is resurfaced and younger-looking. Over time, skin tone is more visibly even and dark spots & wrinkles are visibly reduced. This serum is fragrance free, paraben free, mineral oil free, dye free, allergy tested. Products with Glycolic Acid may increase photosensitivity. Apply Revitalift Triple Power SPF 30 broad spectrum face moisturizer the morning after use of serum.\nSee results or your money back, guaranteed.\n*Money back guarantee, up to $36.99 (sales tax and shipping not refunded), for L’Oréal Paris Revitalift Triple Power or Derm Intensives skin care product. Purchase between 1\/1\/2020-12\/31\/20 redeem by 1\/30\/21. Restrictions apply. For details, call 1-855-332-9983.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/face-serums\/revitalift-derm-intensives-10-pure-glycolic-acid-serum\/lorealparisusa-derm-intensive-pure-glycolic-acid-serum-pdp.png"},{"Unnamed: 0":38,"brand":"L'Oreal Paris","category":"Skincare","name":"Pressed night moisturizer with retinol hydrates","ingredients":"Reach for this deeply moisturizing face cream if you have:\n\nFine lines and wrinkles\nSagging skin\nDry skin\nOily skin\nDull skin\nMature skin\n","details":"Revitalift Pressed Night Cream with Retinol + Niacinamide is formulated with two top derm-recommended ingredients known for their anti-aging properties. With a 12% complex of soothing ingredients, the formula helps balance the potential drying effect of retinol, leaving skin feeling deeply moisturized and softer. Immediately, skin is deeply hydrated (for up to 24 hours). Over Time:\n\nWrinkles are visibly reduced\nUneven skin tone and texture are improved\nContours on the face and neck are firmer and tighter \nComplexion looks brighter, healthier-looking\n\n\nWhat Makes Our Pressed Night Cream Special? \nRetinol, niacinamide and nourishing oils are freshly pressed into a deeply hydrating, yet lightweight night cream. Our first ever fresh-pressed jar makes application hygienic and easy to dose. The formula is non-greasy, absorbs quickly, doesn’t clog pores, and is suitable for all skin types for face, under eyes, neck and décolleté.\n\n\n\nNew to retinoids? No problem! Read more about how to add this moisturizer into your skin care routine at Beauty Magazine.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/night-creams\/pressed-night-moisturizer-with-retinol-hydrates\/loreal-skincare-revitalift-derm-intensives-pressed-night-cream-pure-retinol-front-2.png"},{"Unnamed: 0":39,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift triple power anti aging moisturizer fragrance free","ingredients":"*Ingredient list may vary. Please look at ingredient list printed on the product carton for the latest.\nAQUA \/ WATER \/ EAU\nGLYCERIN\nISOHEXADECANE\nISOPROPYL ISOSTEARATE\nNIACINAMIDE\nALUMINUM STARCH OCTENYLSUCCINATE\nNYLON-12\nDIMETHICONE\nCETYL ALCOHOL\nPOLYETHYLENE\nSTEARYL ALCOHOL\nCETEARYL ALCOHOL\nSTEARIC ACID\nBEHENYL ALCOHOL\nPHENOXYETHANOL\nSYNTHETIC FLUORPHLOGOPITE\nPALMITIC ACID\nPOLYACRYLAMIDE\nCAPRYLOYL SALICYLIC ACID\nSODIUM ACRYLATES COPOLYMER\nCAPRYLIC\/CAPRIC TRIGLYCERIDE\nCI 77891 \/ TITANIUM DIOXIDE\nPEG-100 STEARATE\nCAFFEINE\nASCORBYL GLUCOSIDE\nC13-14 ISOPARAFFIN\nCETEARYL GLUCOSIDE\nDIMETHICONOL\nTOCOPHEROL\nSODIUM HYALURONATE\nRETINYL PALMITATE\nDISODIUM EDTA\nSODIUM HYDROXIDE\nLAURETH-7\nADENOSINE\nMYRISTIC ACID\nPEG-30 DIPOLYHYDROXYSTEARATE\nSORBITAN OLEATE\nTIN OXIDE\nCETEARETH-6 \n\nFIL CODE D233940\/1","details":"DON’T SETTLE FOR JUST HYDRATION. Revitalift Triple Power Fragrance Free Moisturizer is formulated with 3 of the top dermatologist-recommended ingredients: Hyaluronic Acid, Vitamin C, and Pro-Retinol to visibly reduce wrinkles, firm and brighten skin in 1 week. After use, skin feels softer, smoother, and hydrated for 24 hours.\n\nWHY CHOOSE TRIPLE POWER? Revitalift Triple Power Fragrance Free Moisturizer is formulated with top 3 powerful, dermatologist-recommended ingredients:\n• Hyaluronic Acid: A potent hydration-attracting molecule naturally found in skin to enhance and retain moisture levels.\n• Vitamin C: A vital antioxidant naturally found in skin, known to boost radiance, even tone and neutralize free radicals that can lead to signs of aging.\n• Pro-Retinol: A gentle, stabilized derivative of retinol that works with other ingredients in the formula to visibly reduce wrinkles and firm.\n\nSEE VISIBLE RESULTS. Immediately, skin feels softer, smoother, plumped and hydrated for 24 hours. In 1 week, wrinkles are visibly reduced and firmness is noticeably improved. Skin tone is brighter and more radiant. \n\nFOR EVERYDAY USE. Revitalift Triple Power Fragrance Free Moisturizer is dermatologist-tested for safety, non-greasy, absorbs quickly, and is suitable for sensitive skin and everyday use. Paraben free, mineral oil free, dye free, allergy-tested. Also available in Fragranced and Broad-Spectrum SPF 30 Sunscreen.\n\nTHE ANTI-WRINKLE POWER DUO. Pair Triple Power Fragrance Free Moisturizer with 1.5% PURE Hyaluronic Acid Serum for an added boost of hydration and visibly reduced wrinkles for younger-looking skin.\n\nPRO TIP. Revitalift Triple Power Fragrance Free Moisturizer is specially formulated to layer well under makeup without clogging pores. Smooth this cream until thoroughly absorbed to use as a primer and create the perfect moisturized base before makeup.\n\nSee results or your money back, guaranteed.\n*Money back guarantee, up to $36.99 (sales tax and shipping not refunded), for L’Oréal Paris Revitalift skin care products. Purchase between 1\/1\/2021-12\/31\/21 redeem by 1\/29\/22. Restrictions apply. For details, call 1-855-332-9983.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-triple-power-anti-aging-moisturizer-fragrance-free\/revitalift-triple-power-day-cream-fragrance-free\/071249396339_t1.png"},{"Unnamed: 0":40,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift triple power day lotion spf 30","ingredients":"*Ingredient list may vary. Please look at ingredient list printed on the product carton for the latest.\nRevitalift Triple Day Lotion SPF 30  Formula 917113\/14\nACTIVE INGREDIENTS \nAVOBENZONE 3%\nHOMOSALATE 5%\nOCTISALATE\t5%\nOCTOCRYLENE 7%\nCOSMETIC INGREDIENTS \nWATER\nGLYCERIN\nNIACINAMIDE\nSILICA\nDIMETHICONE\nPEG-100 STEARATE\nGLYCERYL STEARATE\nSTEARIC ACID\nPHENOXYETHANOL\nAMMONIUM POLYACRYLOYLDIMETHYL TAURATE\nPALMITIC ACID\nCAFFEINE\nDICAPRYLYL CARBONATE\nSTEARETH-100\nPHENYLETHYL RESORCINOL\nCAPRYLOYL SALICYLIC ACID\nCAPRYLYL GLYCOL\nXANTHAN GUM\nDIMETHICONE\/VINYL DIMETHICONE CROSSPOLYMER\nASCORBYL GLUCOSIDE\nDISODIUM EDTA\nTOCOPHEROL\nBISABOLOL\nSODIUM HYALURONATE\nRETINYL PALMITATE\nFRAGRANCE\nSODIUM HYDROXIDE\nMYRISTIC ACID\nFARNESOL\nBENZYL SALICYLATE\nBENZYL ALCOHOL\nCOUMARIN\nLINALOOL\nFIL CODE D235101\/1","details":"Revitalift Triple Power Broad Spectrum SPF 30 Sunscreen is an anti-aging face moisturizer, formulated with Pro-Retinol, Vitamin C and Hyaluronic Acid  to reduce wrinkles, firm and brighten in 1 week. After use skin feels smoothed, softer, refreshed. Dermatologist tested, suitable for sensitive skin. Paraben free, mineral oil free, dye free, allergy tested.\nSee results or your money back, guaranteed.\nMoney back guarantee, up to $29.99 (sales tax will not be refunded). Restrictions apply. For details, call 1-800-630-5585. Valid in the 50 U.S\/D.C. and only on purchase of a Revitalift Triple Power or Derm Intensives skin care product made between 1\/1\/18 and 12\/31\/19 with original store receipt. Request must be postmarked by 1\/31\/20 and received by 2\/14\/20. Void where prohibited. Limit 1 refund per person and per household.\nPackaging may vary.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/face\/revitalift-triple-power-day-lotion-spf-30\/071249396346_t1.png"},{"Unnamed: 0":41,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift triple power anti aging overnight mask","ingredients":"*Ingredient list may vary. Please look at ingredient list printed on the product carton for the latest.\n\nAQUA\/WATER\nDIMETHICONE\nSIMMONDSIA CHINENSIS OIL\/JOJOBA SEED OIL\nHYDROGENATED CASTOR OIL DIMER DILINOLEATE\nALCOHOL DENAT.\nHYDROXYPROPYL TETRAHYDROPYRANTRIOL\nGLYCERIN\nCAPRYLIC\/CAPRIC TRIGLYCERIDE \nPROPANEDIOL\nPROPYLENE GLYCOL\nCETYL ALCOHOL \nCETYL HYDROXYETHYLCELLULOSE\nSODIUM ACETATE \nSODIUM HYALURONATE \nSODIUMHYDROXIDE\nSODIUM NITRATE \nSILICA \nDISODIUM EDTA \nDISODIUM PHOSPHATE \nHYDROLYZED RICE PROTEIN \nCAPRYLOYL SALICYLIC ACID \nCAPRYLYL GLYCOL \nCENTELLA ASIATICA EXTRACT \nXANTHAN GUM \nPOLYSORBATE 60 \nMETHYLPARABEN\nLINALOOL \nISOEUGENOL\nLIMONENE\nCITRONELLOL \nBENZYL ALCOHOL \nPARFUM\/ FRAGRANCE\n\nFIL CODE B161150\/1","details":"Revitalift Triple Power Overnight Mask, is an anti-aging night moisturizer formulated with 3 of the top proven anti-aging ingredients: Pro-Retinol, Vitamin C and Hyaluronic Acid to visibly reduce wrinkles, firm and brighten skin. Overnight, skin is visibly more radiant and resilient. Paraben free, mineral oil free, dye free, allergy tested.\nSee results or your money back, guaranteed.\nMoney back guarantee, up to $29.99 (sales tax will not be refunded). Restrictions apply. For details, call 1-800-630-5585. Valid in the 50 U.S\/D.C. and only on purchase of a Revitalift Triple Power or Derm Intensives skin care product made between 1\/1\/18 and 12\/31\/19 with original store receipt. Request must be postmarked by 1\/31\/20 and received by 2\/14\/20. Void where prohibited. Limit 1 refund per person and per household.\nPackaging may vary.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/night-creams\/revitalift-triple-power-anti-aging-overnight-mask\/triple-power-anti-aging-overnight\/071249240731_t1.png"},{"Unnamed: 0":42,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift triple power eye treatment","ingredients":"*Ingredient list may vary. Please look at ingredient list printed on the product carton for the latest.\nAQUA \/ WATER \/ EAU\nDIMETHICONE\nGLYCERIN\nSILICA\nACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER\nPRUNUS ARMENIACA KERNEL OIL \/ APRICOT KERNEL OIL\nISOHEXADECANE\nDIMETHICONE\/VINYL DIMETHICONE CROSSPOLYMER\nHYDROXYPROPYL TETRAHYDROPYRANTRIOL\nPROPYLENE GLYCOL\nCI 77891 \/ TITANIUM DIOXIDE\nPHENOXYETHANOL\nACRYLATES\/C10-30 ALKYL ACRYLATE CROSSPOLYMER\nCHLORPHENESIN\nMICA\nTRIETHANOLAMINE\nPOLYSORBATE 80\nCAFFEINE\nASCORBYL GLUCOSIDE\nDIMETHICONOL\nADENOSINE\nTOCOPHEROL\nHYDROLYZED HYALURONIC ACID\nHYDROXYETHYLPIPERAZINE ETHANE SULFONIC ACID\nDISODIUM EDTA\nSORBITAN OLEATE\nTIN OXIDE\n\nFIL CODE D222398\/1","details":"Revitalift Triple Power Eye Cream is an anti-aging eye cream formulated with 3 of the top proven anti-aging ingredients: Pro-Retinol, Vitamin C and Hyaluronic Acid to visibly reduce wrinkles, de-puff and brighten the eye area in 1 week. After use, eyes look visibly more radiant and refreshed. Paraben Free, Allergy Tested, Mineral Oil Free, Fragrance Free and Contact Lens Safe. For best results, use before Revitalift serum or treatment and moisturizer. Layers well under makeup.\nSee results or your money back, guaranteed.\nMoney back guarantee, up to $29.99 (sales tax will not be refunded). Restrictions apply. For details, call 1-800-630-5585. Valid in the 50 U.S\/D.C. and only on purchase of a Revitalift Triple Power or Derm Intensives skin care product made between 1\/1\/18 and 12\/31\/19 with original store receipt. Request must be postmarked by 1\/31\/20 and received by 2\/14\/20. Void where prohibited. Limit 1 refund per person and per household.\nPackaging may vary.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/eye-creams\/revitalift-triple-power-eye-treatment\/triple-power-eye-treatment\/071249227923_t1.png"},{"Unnamed: 0":44,"brand":"L'Oreal Paris","category":"Skincare","name":"Age perfect midnight cream","ingredients":"Step 1. After cleansing, apply Midnight Serum for a boost of concentrated Antioxidants. Reveal smoother, firmer, more radiant, younger looking skin.\n\nStep 2. Treat the eye area with Cell Renewal Anti-aging Eye Cream to visibly reduce 5 signs of aging: Dark circles, Crow’s feet, Bags, Puffiness, and Crepey lids.\n\nStep 3. Moisturize with Midnight Cream for up to 1.5x faster skin barrier recovery and 24 hour hydration. Comfort, firm, and smooth wrinkles with no greasy feel.","details":"Indulge in the magic of Midnight Cream, an ultra-comforting cream with powerful actives for visible anti-aging results. Repair skin barrier up to 1.5x faster. Tested by dermatologists, suitable for sensitive skin. \n\n\nHOW DOES MIDNIGHT CREAM WORK?- Age Perfect Cell Renewal Midnight Cream with Patented Antioxidant and Vitamin E, repairs the skin barrier at night, when skin is most receptive to recovery - Smooth wrinkles, firm and improve radiance. \n\n\nWHAT MAKES MIDNIGHT CREAM UNIQUE?- Midnight Cream has a Wrapping Texture that creates the optimal environment for skin barrier repair. The lightweight, non-greasy cream melts in to skin, infusing it with Antioxidants and 24 hour hydration.\n\n\nVisible results- Skin barrier is improved, skin is deeply moisturized and smoothed the next morning. Over time, skin looks firmer, more radiant, revitalized and wrinkles are visibly reduced. Effective for all skin tones.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/night-creams\/age-perfect-midnight-cream\/18-12-23\/071249668108_t1.png"},{"Unnamed: 0":50,"brand":"L'Oreal Paris","category":"Skincare","name":"Collagen expert night moisturizer for face","ingredients":"Aqua \/ Water \/ Eau, Dimethicone, Glycerin, Caprylic\/Capric Triglyceride, Octyldodecanol, Niacinamide, Myristyl Myristate, Butyrospermum Parkii Butter \/ Shea Butter, Stearic Acid, Palmitic Acid, Ammonium Polyacryloyldimethyl Taurate, Cera Alba \/ Beeswax \/ Cire Dabeille, Glyceryl Stearate, Peg-100 Stearate, Ethylhexyl Palmitate, Capryloyl Salicylic Acid, Palmitoyl Tetrapeptide-7, Palmitoyl Tripeptide-1, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Sodium Hydroxide, Calcium Pantothenate, Cetyl Alcohol, Stearyl Alcohol, Silica, Aluminum Starch Octenylsuccinate, Butylene Glycol, Caprylyl Glycol, Carbomer, Citric Acid, Myristic Acid, Peg-20 Stearate, Polysorbate 20, Sodium Lactate, Citronellol, Limonene, Phenoxyethanol, Parfum \/ Fragrance F.I.L. # T2778833\/2\n","details":"RETIGHTENED, FIRMER, MORE EVEN SKIN! Age Perfect Collagen Expert Night Moisturizer provides a daily boost of Collagen Peptides + Niacinamide to intensely rehydrate and firm maturing skin. Paraben free. Mineral oil free. Dye free. Allergy tested.\n\nWHAT IS COLLAGEN? Collagen is a natural protein abundantly present in the skin. It provides skin’s strength, firmness, and bounce. After 50, the skin’s collagen production slows which can lead to loss of volume and sagging.\n\nWHAT ARE PEPTIDES? Recommended by dermatologists, peptides are the building blocks of collagen and are key for its natural production in the skin. Our collagen peptides, along with the other ingredients in our powerful formula, help lock in moisture, firm and retighten skin.\n\nWHAT IS NIACINAMIDE? Also known as Vitamin B3, this essential nutrient helps to brighten skin overall and to reduce age spots.\n\nVISIBLE RESULTS In the morning, skin is intensely hydrated, and contours feel toned. Over time, skin looks tighter, and firmer with brighter, more even tone. Overall complexion looks younger and healthier.\n\nHYDRATING, NON-GREASY TEXTURE: This lightweight face cream provides all-night hydration. It absorbs quickly and doesn’t leave a greasy or sticky finish.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/night-creams\/collagen-expert-night-moisturizer-for-face\/loreal-skin-age-perfect-anti-sagging-even-tone-collagen-expert-night-moisturizer-primary.png"},{"Unnamed: 0":51,"brand":"L'Oreal Paris","category":"Skincare","name":"Collagen expert day moisturizer with spf 30","ingredients":"917152 18 - Ingredients:  Water, Glycerin, Dimethicone, Niacinamide, Silica, Alcohol Denat., Octyldodecanol, Isopropyl Isostearate, Behenyl Alcohol, Phenoxyethanol, Butylene Glycol, Acrylamide\/Sodium Acryloyldimethyltaurate Copolymer, Tocopherol, Aluminum Starch Octenylsuccinate, Ammonium Acryloyldimethyltaurate\/Steareth-25 Methacrylate Crosspolymer, Cetyl Alcohol, Dimethicone\/Vinyl Dimethicone Crosspolymer, Dimethiconol, Peg-100 Stearate, Capryloyl Salicylic Acid, Isohexadecane, Cetearyl Alcohol, Trisodium Ethylenediamine Disuccinate, Carbomer, Fragrance, Sodium Hyaluronate, Ethylhexylglycerin, Polysorbate 80, Cetearyl Glucoside, Sorbitan Oleate, Sodium Lactate, Sodium Hydroxide, Polysorbate 20, Citronellol, Limonene, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7 Fil V279603\/1\n","details":"RETIGHTENED, DENSER, MORE EVEN SKIN! Age Perfect Collagen Expert Day Moisturizer provides a daily boost of Collagen Peptides + Niacinamide to intensely rehydrate and redensify maturing skin. Formulated with Broad Spectrum SPF 30 Sunscreen, this formula also helps protect against two types of UV rays (UVA\/UVB) that cause skin damage and premature aging. Paraben free. Mineral oil free. Allergy tested. Suitable for even sensitive skin.\n\nWHAT IS COLLAGEN? Collagen is a natural protein abundantly present in the skin. It provides skin’s strength, firmness, and bounce. After 50, the skin’s collagen production slows which can lead to loss of volume and sagging.\n\nWHAT ARE PEPTIDES? Recommended by dermatologists, peptides are the building blocks of collagen and are key for its natural production in the skin. Our collagen peptides, along with the other ingredients in our powerful formula, help lock in moisture, redensify and retighten skin.\n\nWHAT IS NIACINAMIDE? Also known as Vitamin B3, this essential nutrient helps to brighten skin overall and to reduce age spots.\n\nVISIBLE RESULTS After 1 use, skin is intensely rehydrated and nourished. After 4 weeks, skin feels stronger, denser and contours appear more toned. Skin’s radiance and brightness also improve, while overall complexion appears healthier.\n\nHYDRATING, NON-GREASY TEXTURE: This lightweight face cream provides all-day hydration. It absorbs quickly and doesn’t leave a greasy or sticky finish.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/collagen-expert-day-moisturizer-with-spf-30\/loreal-skin-age-perfect-anti-sagging-even-tone-collagen-expert-moisturizer-spf-primary.png"},{"Unnamed: 0":52,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift anti wrinkle firming day cream spf 25","ingredients":"AQUA \/ WATER • CYCLOHEXASILOXANE • ETHYLHEXYL METHOXYCINNAMATE • GLYCERIN • MYRISTYL MYRISTATE  • PHENYLBENZIMIDAZOLE SULFONIC ACID • ALCOHOL DENAT. • TRIETHANOLAMINE • STEARIC ACID • AMMONIUM POLYACRYLDIMETHYLTAURAMIDE \/ AMMONIUM • POLYACRYLOYLDIMETHYL TAURATE • PALMITIC ACID • TITANIUM DIOXIDE • PEG-100 STEARATE • CERA ALBA \/ BEESWAX • GLYCERYL STEARATE • PEG-20 STEARATE • STEARYL ALCOHOL • GLYCINE SOJA PROTEIN \/ SOYBEAN PROTEIN • ALUMINA • PHENETHYL ALCOHOL • HYDROLYZED SOY PROTEIN • ACETYL TRIFLUOROMETHYLPHENYL VALYLGLYCINE • FAEX EXTRACT \/ YEAST EXTRACT • ACRYLATES COPOLYMER • CETYL ALCOHOL • RETINYL PALMITATE • POTASSIUM SORBATE • METHYLPARABEN • SODIUM BENZOATE • PHENOXYETHANOL • CHLORPHENESIN • ETHYLPARABEN • LINALOOL • GERANIOL • ALPHA-ISOMETHYL IONONE • AMYL CINNAMAL • LIMONENE • CITRAL • CITRONELLOL • BUTYLPHENYL METHYLPROPIONAL • HEXYL CINNAMAL • BENZYL ALCOHOL • BENZYL BENZOATE • BENZYL CINNAMATE • BENZYL SALICYLATE • PARFUM \/ FRAGRANCE","details":"Experience advanced action against the signs of aging. RevitaLift Anti-Wrinkle + Firming Cream SPF 25, a unique daily moisturizer with broad spectrum UVA\/UVB SPF 25 sunscreen protection, delivers smoother, firmer skin in just 4 weeks. Fortified with Pro-Retinol A and Stimuplex, Revitalift Anti-Wrinkle + Firming works to increase cell turnover, reduce wrinkles, firm skin, and provide 24-hour hydration.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-anti-wrinkle-firming-day-cream-spf-25\/anti-wrinkle-firming-day-cream-spf-25\/071249104583_t1.png"},{"Unnamed: 0":53,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift anti wrinkle firming eye cream","ingredients":"AQUA \/ WATER • DIMETHICONE • GLYCERIN • C12-15 ALKYL BENZOATE • SHOREA ROBUSTA BUTTER \/ SHOREA ROBUSTA SEED BUTTER • STEARIC ACID • PALMITIC ACID • PEG-100 STEARATE • GLYCERYL STEARATE • PEG-20 STEARATE • STEARYL ALCOHOL • PARAFFIN • GLYCINE SOJA PROTEIN \/ SOYBEAN PROTEIN • TRIETHANOLAMINE • CAFFEINE • ISOHEXADECANE • PHENETHYL ALCOHOL • HYDROLYZED SOY PROTEIN • ACETYL TRIFLUOROMETHYLPHENYL VALYLGLYCINE • FAEX EXTRACT \/ YEAST EXTRACT • POLYSORBATE 80 • ACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER • ACRYLATES COPOLYMER • CETYL ALCOHOL • RETINYL PALMITATE • POTASSIUM SORBATE • METHYLPARABEN • SODIUM BENZOATE • CHLORHEXIDINE DIGLUCONATE • ETHYLPARABEN • PHENOXYETHANOL","details":"Firmer lids. Fewer Wrinkles. Less Puffiness. Now, 360-degree action around the eyes for smoother, firmer skin in just 4 weeks. This unique daily moisturizer delivers anti-wrinkle and firming action, created specially to care for the delicate area around the eyes.Experience advanced action against the signs of aging. RevitaLift® Anti-Wrinkle + Firming Eye Cream (with Pro-Retinol A and Stimuplex)  reduces wrinkles, firms skin, and reduces the “morning puffy look.”","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/eye-creams\/revitalift-anti-wrinkle-firming-eye-cream\/anti-wrinkle-firming-eye-cream\/071249104613_t1.png"},{"Unnamed: 0":54,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift anti wrinkle firming night cream","ingredients":"AQUA \/ WATER • GLYCERIN • DIMETHICONE • HYDROGENATED POLYISOBUTENE •  CETYL ALCOHOL • GLYCERYL STEARATE • ALUMINUM STARCH OCTENYLSUCCINATE • PEG-40 STEARATE • PRUNUS ARMENIACA KERNEL OIL \/ APRICOT KERNEL OIL • SHOREA ROBUSTA BUTTER \/ SHOREA ROBUSTA SEED BUTTER • PARAFFINUM LIQUIDUM \/ MINERAL OIL • PARAFFIN • ZEA MAYS EXTRACT \/ CORN KERNEL EXTRACT • STEARIC ACID • STEARYL ALCOHOL • CERA MICROCRISTALLINA \/ MICROCRYSTALLINE WAX • SORBITAN TRISTEARATE • GLYCINE SOJA PROTEIN \/ SOYBEAN PROTEIN • TRIETHANOLAMINE • ISOHEXADECANE • MYRISTYL ALCOHOL • PALMITIC ACID • PHENETHYL ALCOHOL • HYDROLYZED SOY PROTEIN • CAPRYLYL GLYCOL • ACETYL TRIFLUOROMETHYLPHENYL VALYLGLYCINE • FAEX EXTRACT \/ YEAST EXTRACT •  POLYSORBATE 80 • ACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER • RETINYL PALMITATE • POTASSIUM SORBATE • SODIUM BENZOATE •  PHENOXYETHANOL • LINALOOL • GERANIOL • ALPHA-ISOMETHYL IONONE • AMYL CINNAMAL • LIMONENE • CITRAL • CITRONELLOL • BUTYLPHENYL METHYLPROPIONAL • HEXYL CINNAMAL • BENZYL ALCOHOL • BENZYL BENZOATE • BENZYL CINNAMATE • BENZYL SALICYLATE • PARFUM \/ FRAGRANCE","details":"This unique nighttime moisturizer delivers anti-wrinkle and firming action while you sleep. Each morning, skin will appear refreshed, radiant, and younger looking. Experience advanced action against the signs of aging with smoother, firmer skin in just 4 weeks. RevitaLift® Anti-Wrinkle + Firming Night Cream (with Pro-Retinol® A and Stimuplex) reduces wrinkles, firms skin, and provides 24 hour moisturization.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/night-creams\/revitalift-anti-wrinkle-firming-night-cream\/anti-wrinkle-firming-night-cream\/071249104590_t1.png"},{"Unnamed: 0":55,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift anti wrinkle firming moisturizer","ingredients":"AQUA \/ WATER • CYCLOHEXASILOXANE • GLYCERIN • PARAFFINUM LIQUIDUM \/ MINERAL OIL • MYRISTYL MYRISTATE • SHOREA ROBUSTA BUTTER \/ SHOREA ROBUSTA SEED BUTTER • STEARIC ACID • PALMITIC ACID • PEG-100 STEARATE • CERA ALBA \/ BEESWAX • GLYCERYL STEARATE • PEG-20 STEARATE • STEARYL ALCOHOL • GLYCINE SOJA PROTEIN \/ SOYBEAN PROTEIN • TRIETHANOLAMINE • ISOHEXADECANE • PHENETHYL ALCOHOL • HYDROLYZED SOY PROTEIN • ACETYL TRIFLUOROMETHYLPHENYL VALYLGLYCINE • FAEX EXTRACT \/ YEAST EXTRACT • • POLYSORBATE 80 • ACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER • ACRYLATES COPOLYMER • CETYL ALCOHOL • RETINYL PALMITATE • POTASSIUM SORBATE • METHYLPARABEN • SODIUM BENZOATE • CHLORHEXIDINE DIGLUCONATE • ETHYLPARABEN • LINALOOL • GERANIOL • ALPHA-ISOMETHYL IONONE • AMYL CINNAMAL • LIMONENE • CITRONELLOL • BUTYLPHENYL METHYLPROPIONAL • HEXYL CINNAMAL • BENZYL ALCOHOL • BENZYL BENZOATE • BENZYL SALICYLATE • PARFUM \/ FRAGRANCE • PHENOXYETHANOL","details":"Revitalift Anti-Wrinkle & Firming Moisturizer Visibly reduces wrinkles and firms skin in 4 weeks. Now also available in Fragrance Free.\n\nDaily anti-aging moisturizer with Pro-Retinol, a stabilized retinol derivative that works alongside other ingredients in this formula to visibly reduce wrinkles and firm skin. Our face moisturizer also features Centella Asiata, commonly known as gotu kola, an herb from traditional Chinese medicine that helps repair the skin barrier and resist visible signs of aging. Paraben Free, Dye Free, Allergy tested, and now also available in Fragrance Free. Dermatologist tested, suitable for sensitive skin. Our moisturizer is specially formulated to layer well under makeup.\nSee results or your money back, guaranteed.\nMoney back guarantee, up to $29.99 (sales tax will not be refunded). Restrictions apply. For details, call 1-800-630-5585. Valid in the 50 U.S\/D.C. and only on purchase of a Revitalift Triple Power or Derm Intensives skin care product made between 1\/1\/18 and 12\/31\/19 with original store receipt. Request must be postmarked by 1\/31\/20 and received by 2\/14\/20. Void where prohibited. Limit 1 refund per person and per household.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-anti-wrinkle-firming-moisturizer\/anti-wrinkle-firming-moisturizer\/071249104606_t1-2.png"},{"Unnamed: 0":56,"brand":"L'Oreal Paris","category":"Skincare","name":"Revitalift anti wrinkle firming moisturizer fragrance free","ingredients":"AQUA \/ WATER\nCYCLOHEXASILOXANE\nGLYCERIN\nPARAFFINUM LIQUIDUM \/ MINERAL OIL\nPROPANEDIOL\nMYRISTYL MYRISTATE\nSHOREA ROBUSTA SEED BUTTER\nSTEARIC ACID\nPALMITIC ACID\nPEG-100 STEARATE\nCERA ALBA \/ BEESWAX\nGLYCERYL STEARATE\nPEG-20 STEARATE\nACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER\nCETYL ALCOHOL\nPHENOXYETHANOL\nSTEARYL ALCOHOL\nHYDROLYZED SOY PROTEIN\nISOHEXADECANE\nCAPRYLYL GLYCOL\nGLYCINE SOJA PROTEIN \/ SOYBEAN PROTEIN\nACRYLONITRILE\/METHYL METHACRYLATE\/VINYLIDENE CHLORIDE COPOLYMER\nTRIETHANOLAMINE\nPOLYSORBATE 80\nRETINYL PALMITATE\nPENTAERYTHRITYL TETRA-DI-T-BUTYL HYDROXYHYDROCINNAMATE\nACETYL TRIFLUOROMETHYLPHENYL VALYLGLYCINE\nMYRISTIC ACID\nPENTYLENE GLYCOL\nSORBITAN OLEATE\nSODIUM COCOYL GLUTAMATE\nFAEX EXTRACT \/ YEAST EXTRACT\nETHYLHEXYLGLYCERIN\nSODIUM BENZOATE\nISOBUTANE\nPHENETHYL ALCOHOL\nPOTASSIUM SORBATE\nCENTELLA ASIATICA EXTRACT\nSALICYLOYL PHYTOSPHINGOSINE\nTOCOPHEROL\n\nFIL CODE D235099\/1","details":"Revitalift Anti-Wrinkle & Firming Moisturizer Visibly reduces wrinkles and firms skin in 4 weeks. Now also available in Fragrance Free\n\nDaily anti-aging moisturizer with Pro-Retinol, a stabilized retinol derivative that works alongside other ingredients in this formula to visibly reduce wrinkles and firm skin. Our face moisturizer also features Centella Asiata, commonly known as gotu kola, an herb from traditional Chinese medicine that helps repair the skin barrier and resist visible signs of aging. Paraben Free, Dye Free, Allergy tested, and now also available in Fragrance Free. Dermatologist tested, suitable for sensitive skin. Our moisturizer is specially formulated to layer well under makeup.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/revitalift-anti-wrinkle-firming-moisturizer-fragrance-free\/071249403907_t1.png"},{"Unnamed: 0":63,"brand":"L'Oreal Paris","category":"Skincare","name":"Wrinkle expert 55 anti wrinkle eye treatment","ingredients":"AQUA\/WATER \nGLYCERIN \nISOHEXADECANE \nDIMETHICONE \nISOPROPYL ISOSTEARATE\nALUMINUM STARCH OCTENYLSUCCINATE\nPROPYLENE GLYCOL \nNYLON-12 \nOCTYLDODECANOL \nCETYL ALCOHOL \nBEHENYL ALCOHOL \nAMMONIUM\nPOLYACRYLOYLDIMETHYL TAURATE \nPHENOXYETHANOL\nPOLYETHYLENE \nCETEARYL ALCOHOL \nSTEARIC\nACID \nPALMITIC ACID \nPOLYACRYLAMIDE \nDISODIUM\nSTEAROYL GLUTAMATE \nCAPRYLOYL SALICYLIC ACID \nCAPRYLYL GLYCOL \nPEG-100 STEARATE\nC13-14 ISOPARAFFIN\nCETEARYL GLUCOSIDE \nDISODIUM EDTA \nLAURETH-7 \nCALCIUM PCA \nTRIETHANOLAMINE \nADENOSINE \nT-BUTYL ALCOHOL \nMYRISTIC ACID \nF.I.L.# D204134\/1","details":"Starting in your fifties, skin loses vital nourishment and becomes thinner. The skin around the eye area becomes drier, which can lead to an increase in the appearance of wrinkles, making you look older. Wrinkle Expert Eye Treatment for ages 55+ is formulated with Calcium to strengthen thinning skin around the eye and improve smoothness. Wrinkle Expert eye cream visibly reduces the signs of aging including crow's feet, dryness and skin texture. With this under eye moisturizer, skin is mmediately moisturized, feels softer and smoother. In just 4 weeks, crow’s feet look improved.\n","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/eye-creams\/wrinkle-expert-55-anti-wrinkle-eye-treatment\/55-anti-wrinkle-eye-treatment\/t1_we-55-product-shot.png"},{"Unnamed: 0":64,"brand":"L'Oreal Paris","category":"Skincare","name":"Age perfect rosy tone moisturizer for mature dull skin","ingredients":"Always read the ingredient list on the product label before use. Please consult the product packaging on the shade level at your local store for detailed product ingredients and application instructions.\n\nAQUA \/ WATER \/ EAU\nSQUALANE\nCYCLOHEXASILOXANE\nGLYCERIN\nCETYL ALCOHOL\nGLYCERYL STEARATE\nPEG-40 STEARATE\nMYRISTYL MYRISTATE\nPENTAERYTHRITYL TETRAETHYLHEXANOATE\nOCTYLDODECANOL\nSORBITAN TRISTEARATE\nBUTYLENE GLYCOL\nPHENOXYETHANOL\nACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER\nSYNTHETIC FLUORPHLOGOPITE\nCI 77891 \/ TITANIUM DIOXIDE\nISOHEXADECANE\nCAPRYLOYL SALICYLIC ACID\nMANNITOL\nSILICA\nASCORBYL GLUCOSIDE\nPARFUM \/ FRAGRANCE\nCHLORPHENESIN\nMICA\nPOLYSORBATE 80\nPAEONIA ALBIFLORA ROOT EXTRACT\nDISODIUM EDTA\nCI 77163 \/ BISMUTH OXYCHLORIDE\nCI 77491 \/ IRON OXIDES\nHYDROLYZED CICER SEED EXTRACT\nSODIUM HYDROXIDE\nSORBITAN OLEATE\nIRIS FLORENTINA ROOT EXTRACT\nVIGNA ACONITIFOLIA SEED EXTRACT\nCYCLODEXTRIN\nSODIUM COCOYL GLUTAMATE\nFAEX EXTRACT \/ YEAST EXTRACT \/ EXTRAIT DE LEVURE\nHEXYL CINNAMAL\nTIN OXIDE\nBENZYL ALCOHOL\nHYDROXYCITRONELLAL\nBENZYL SALICYLATE\nLINALOOL\nCITRONELLOL\nLIMONENE\nGERANIOL\nALPHA-ISOMETHYL IONONE\nDISODIUM SUCCINATE \n\nFIL CODE D238413\/1","details":"Age Perfect® Rosy Tone Moisturizer is a daily face cream for mature, dull skin. This moisturizer for mature skin is formulated with Imperial Peony Extracts and LHA to gently exfoliate dull, sallow skin and revive skin's natural rosy tone. As skin matures, its ability to renew surface cells slows down. As a result, skin's natural pink tone is hidden and complexion becomes dull, losing its natural rosy tone of youth. Help promote a younger-looking, smooth complexion with Age Perfect Rosy Tone Moisturizer, a face cream for mature, dull skin. \n\n*Packaging may vary, what you receive may not be what is reflected on site.\n\n*Money back guarantee, up to $24.99 (sales tax and shipping not refunded), for L’Oréal Paris Age Perfect. Purchase made between 3\/1\/2020-12\/31\/20 redeem by 1\/30\/21. Restrictions apply. For details, call 1-855-332-9983. ","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/age-perfect-rosy-tone-moisturizer-for-mature-dull-skin\/rosy-tone-moisturizer-for-mature-dull-skin\/071249331262_t1.png"},{"Unnamed: 0":67,"brand":"L'Oreal Paris","category":"Skincare","name":"Age perfect rosy tone fragrance free face moisturizer","ingredients":"Always read the ingredient list on the product label before use. Please consult the product packaging on the shade level at your local store for detailed product ingredients and application instructions.\n\nAQUA\/WATER\/EAU\nSQUALANE\nCYCLOHEXASILOXANE\nGLYCERIN\nCETYL ALCOHOL\nGLYCERYL STEARATE\nPEG-40 STEARATE\nMYRISTYL\nMYRISTATE\nPENTAERYTHRITYL TETRAETHYLHEXANOATE\nOCTYLDODECANOL \nSORBITAN TRISTEARATE\nBUTYLENE GLYCOL\nPHENOXYETHANOL \nACRYLAMIDE\/SODIUM\nACRYLOYLDIMETHYLTAURATE COPOLYMER \nMETHYLDIHYDROJASMONATE\nSYNTHETIC FLUORPHLOGOPITE \nCI 77891\/TITANIUM DIOXIDE \nISOHEXADECANE\nCAPRYLOYL SALICYLIC ACID \nACRYLONITRILE\/METHYL METHACRYLATE\/VINYLIDENE\nCHLORIDE COPOLYMER \nMANNITOL \nASCORBYL GLUCOSIDE \nCHLORPHENESIN \nMICA \nPOLYSORBATE 80 \nPAEONIA ALBIFLORA ROOT EXTRACT \nDISODIUM EDTA \nCI 77163\/BISMUTH OXYCHLORIDE \nCI 77491\/IRON OXIDES \nHYDROLYZED CICER SEED EXTRACT \nSORBITAN OLEATE \nISOBUTANE \nSODIUM HYDROXIDE \nIRIS FLORENTINA\nROOT EXTRACT \nVIGNA ACONITIFOLIA SEED EXTRACT \nCYCLODEXTRIN \nSODIUM\nCOCOYL GLUTAMATE \nFAEX EXTRACT\/YEAST EXTRACT\/EXTRAIT DE LEVURE \nTIN OXIDE\nDISODIUM SUCCINATE \nBHT \n\nFIL CODE D226251\/1","details":"L’Oréal Paris Age Perfect® Rosy Tone Fragrance Free Moisturizer is a rich, non-greasy daily moisturizing cream for mature skin. As skin matures, its ability to renew surface cells slows down. As a result, skin's natural pink tone is hidden and complexion becomes dull, losing its natural rosy tone of youth. The formula with Imperial Peony and LHA gently exfoliates dull, sallow skin. This daytime moisturizer revives skin’s natural pink tone. Results immediately and over time: smooth and renewed skin with a healthy and rosy complexion\n*Packaging may vary, what you receive may not be what is reflected on site.\n*Money back guarantee, up to $24.99 (sales tax and shipping not refunded), for L’Oréal Paris Age Perfect. Purchase made between 3\/1\/2020-12\/31\/20 redeem by 1\/30\/21. Restrictions apply. For details, call 1-855-332-9983. ","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/age-perfect-rosy-tone-fragrance-free-face-moisturizer\/rosy-tone-fragrance-free-face-moisturizer\/071249386910_t1.png"},{"Unnamed: 0":80,"brand":"L'Oreal Paris","category":"Skincare","name":"Age perfect hydra nutrition manuka honey night balm","ingredients":"782852\/47\nAQUA \/ WATER\nPARAFFINUM LIQUIDUM \/ MINERAL OIL\nGLYCERIN\nISOCETYL STEARATE\nHYDROGENATED POLYISOBUTENE\nCYCLOHEXASILOXANE\nBUTYROSPERMUM PARKII BUTTER \/ SHEA BUTTER\nCERA ALBA \/ BEESWAX\nCETYL ALCOHOL\nGLYCERYL STEARATE\nPEG-100 STEARATE\nMEL \/ HONEY\nHYDROXYETHYLPIPERAZINE ETHANE SULFONIC ACID\nPRUNUS ARMENIACA KERNEL OIL \/ APRICOT KERNEL OIL\nZEA MAYS OIL \/ CORN OIL\nMEL EXTRACT \/ HONEY EXTRACT\nCERA MICROCRISTALLINA \/ MICROCRYSTALLINE WAX\nPARAFFIN\nROYAL JELLY EXTRACT\nISOBUTANE\nSORBITAN OLEATE\nSORBITAN TRISTEARATE\nCALCIUM PANTETHEINE SULFONATE\nDIMETHICONE\nCOPERNICIA CERIFERA CERA \/ CARNAUBA WAX\nISOHEXADECANE\nSODIUM HYDROXIDE\nASCORBYL GLUCOSIDE\nDISODIUM EDTA\nPROPYLENE GLYCOL\nCAPRYLYL GLYCOL\nCITRIC ACID\nPASSIFLORA EDULIS SEED OIL\nXANTHAN GUM\nPOLYSORBATE 80\nACRYLAMIDE\/SODIUM ACRYLOYLDIMETHYLTAURATE COPOLYMER\nACRYLONITRILE\/METHYL METHACRYLATE\/VINYLIDENE CHLORIDE COPOLYMER\nORYZA SATIVA BRAN OIL \/ RICE BRAN OIL\nTOCOPHEROL\nASCORBYL PALMITATE\nCI 15985 \/ YELLOW 6\nCI 19140 \/ YELLOW 5\nLINALOOL\nGERANIOL\nEUGENOL\nCOUMARIN\nLIMONENE\nCITRONELLOL\nBENZYL ALCOHOL\nPARFUM \/ FRAGRANCE","details":"Luxurious night balm face moisturizer with nurturing oils and Manuka Honey Extract is infused with calcium and antioxidants. Melts into skin for incredible nourishing comfort with 48H of long lasting, non-greasy, non-sticky hydration. Effectively penetrates into the skin's surface layer to comfort and strengthen mature, very dry skin. Skin on the face, neck, and chest is firmer, stronger, and more resilient. Paraben free, allergy tested, suitable for sensitive skin. Packaging May Vary. What you receive may not be what is reflected on site.\n\n• New look and improved formula to our Age Perfect Hydra-Nutrition Golden Balm\n• Luxurious formula with nurturing oils and Manuka honey extract helps very dry skin retain moisture for 48 hours \n• Immediately skin's moisture level surges - in 4 weeks skin looks firmer and resilient\n• Paraben free, allergy tested, suitable for sensitive skin\n\n*Money back guarantee, up to $24.99 (sales tax and shipping not refunded), for L’Oréal Paris Age Perfect. Purchase made between 3\/1\/2020-12\/31\/20 redeem by 1\/30\/21. Restrictions apply. For details, call 1-855-332-9983. ","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/night-creams\/age-perfect-hydra-nutrition-manuka-honey-night-balm\/hydra-nutrition-manuka-honey-night-balm\/071249383018_t1.png"},{"Unnamed: 0":93,"brand":"L'Oreal Paris","category":"Skincare","name":"Men expert vita lift anti wrinkle firming moisturizer","ingredients":"AQUA \/ WATER\nGLYCERINCYCLOHEXASILOXANE\nCAPRYLIC\/CAPRIC TRIGLYCERIDE\nDIMETHICONEALUMINUM STARCHOCTENYLSUCCINATE\nCYCLOPENTASILOXANEPEG-100 STEARATEGLYCERYL STEARATE\nBUTYROSPERMUM PARKII BUTTER \/ SHEA BUTTERMENTHA PIPERITA EXTRACT \/ PEPPERMINT LEAF EXTRACTC12-13 PARETH-23\nC12-13 PARETH-3STEARIC ACID\nTRIETHANOLAMINEDIMETHICONOL\nLITHIUM MAGNESIUM SODIUMSILICATESODIUM CITRATE\nSILICADIVINYLDIMETHICONE\/DIMETHICONECOPOLYMERPALMITIC ACID\nASCORBYL GLUCOSIDEAMMONIUM POLYACRYLDIMETHYLTAURAMIDE \/ AMMONIUMPOLYACRYLOYLDIMETHYL TAURATE\nXANTHAN GUM\nPISUM SATIVUM EXTRACT \/ PEA EXTRACTACRYLATES COPOLYMER\nCETYL ALCOHOLBUTYLENE GLYCOL\nRETINYL PALMITATEIMIDAZOLIDINYL UREAMETHYLPARABEN\nPHENOXYETHANOLBUTYLPARABEN\nLINALOOLLIMONENEPARFUM \/ FRAGRANCEPOTASSIUM SORBATE\nCHLORPHENESIN","details":"Men Expert Vita Lift SPF 15 Anti-Wrinkle & Firming Moisturizer is formulated specifically for wrinkles, sagging skin, or loss of firmness. Fortified Pro-Retinol A, a form of Vitamin A, helps reduce wrinkles and sagging skin while firming up the face and neck. Active Defense System (ADS) , our patented system that protects your skin against irritation, so you’re less likely to get redness, burning, or tightness.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/men-expert-vita-lift-anti-wrinkle-firming-moisturizer\/vita-lift-anti-wrinkle-firming-moisturizer\/071249017609_t1.png"},{"Unnamed: 0":94,"brand":"L'Oreal Paris","category":"Skincare","name":"Men expert vita lift spf 15 anti wrinkle firming moisturizer","ingredients":"AQUA \/ WATER\nGLYCERINCYCLOHEXASILOXANE\nCAPRYLIC\/CAPRIC TRIGLYCERIDE\nDIMETHICONEALUMINUM STARCHOCTENYLSUCCINATE\nCYCLOPENTASILOXANEPEG-100 STEARATEGLYCERYL STEARATE\nBUTYROSPERMUM PARKII BUTTER \/ SHEA BUTTERMENTHA PIPERITA EXTRACT \/ PEPPERMINT LEAF EXTRACTC12-13 PARETH-23\nC12-13 PARETH-3STEARIC ACID\nTRIETHANOLAMINEDIMETHICONOL\nLITHIUM MAGNESIUM SODIUMSILICATESODIUM CITRATE\nSILICADIVINYLDIMETHICONE\/DIMETHICONECOPOLYMERPALMITIC ACID\nASCORBYL GLUCOSIDEAMMONIUM POLYACRYLDIMETHYLTAURAMIDE \/ AMMONIUMPOLYACRYLOYLDIMETHYL TAURATE\nXANTHAN GUM\nPISUM SATIVUM EXTRACT \/ PEA EXTRACTACRYLATES COPOLYMER\nCETYL ALCOHOLBUTYLENE GLYCOL\nRETINYL PALMITATEIMIDAZOLIDINYL UREAMETHYLPARABEN\nPHENOXYETHANOLBUTYLPARABEN\nLINALOOLLIMONENEPARFUM \/ FRAGRANCEPOTASSIUM SORBATE\nCHLORPHENESIN\n","details":"Men Expert Vita Lift SPF 15 Anti-Wrinkle & Firming Moisturizer is formulated specifically for wrinkles, sagging skin, and loss of firmness. Fortified Pro-Retinol A, a form of Vitamin A, helps reduce wrinkles and sagging skin while firming up the face and neck. Active Defense System (ADS) , our patented system that protects your skin against irritation, so you’re less likely to get redness, burning, or tightness. SPF 15 protects your skin against damaging UVA (aging) and UVB (burning) rays.","image_url":"https:\/\/www.lorealparisusa.com\/\/-\/media\/project\/loreal\/brand-sites\/oap\/americas\/us\/products\/skin-care\/facial-moisturizers\/men-expert-vita-lift-spf-15-anti-wrinkle-firming-moisturizer\/vita-lift-spf-15-anti-wrinkle-firming-moisturizer\/071249098721_t1.png"}]